{
    "COMP SCI": {
        "102": {
            "title": "INTRODUCTION TO COMPUTING",
            "description": "Provides a broad overview of computing at an introductory level, including topics such as security, robotics, and artificial intelligence. Increases understanding of how computers work and how algorithms solve problems. Design and implement creative applications in an introductory coding environment. Provides a broad overview of computing and algorithms without an emphasis on programming."
        },
        "200": {
            "title": "PROGRAMMING I",
            "description": "Learn the process of incrementally developing small (200-500 lines) programs along with the fundamental Computer Science topics. These topics include: problem abstraction and decomposition, the edit-compile-run cycle, using variables of primitive and more complex data types, conditional and loop-based flow control, basic testing and debugging techniques, how to define and call functions (methods), and IO processing techniques. Also teaches and reinforces good programming practices including the use of a consistent style, and meaningful documentation. Intended for students who have no prior programming experience."
        },
        "220": {
            "title": "DATA SCIENCE PROGRAMMING I",
            "description": "Introduction to Data Science programming using Python.  No previous programming experience required.  Emphasis on analyzing real datasets in a variety of forms and visual communication."
        },
        "240": {
            "title": "INTRODUCTION TO DISCRETE MATHEMATICS",
            "description": "Basic concepts of logic, sets, partial order and other relations, and functions. Basic concepts of mathematics (definitions, proofs, sets, functions, and relations) with a focus on discrete structures: integers, bits, strings, trees, and graphs.  Propositional logic, Boolean algebra, and predicate logic. Mathematical induction and recursion. Invariants and algorithmic correctness. Recurrences and asymptotic growth analysis. Fundamentals of counting."
        },
        "252": {
            "title": "INTRODUCTION TO COMPUTER ENGINEERING",
            "description": "Logic components built with transistors, rudimentary Boolean algebra, basic combinational logic design, basic synchronous sequential logic design, basic computer organization and design, introductory machine- and assembly-language programming."
        },
        "270": {
            "title": "FUNDAMENTALS OF HUMAN-COMPUTER INTERACTION",
            "description": "User-centered software design including principles and methods for understanding user needs, designing and prototyping interface solutions, and evaluating their usability covered through lectures and hands-on in-class activities.  Meets withCOMP SCI 570."
        },
        "272": {
            "title": "INTRODUCTION TO WEB DEVELOPMENT",
            "description": "Introduces methods and tools for creating/maintaining secure and interactive web content. Topics include programming fundamentals to support core web concepts, application development essentials, and content management systems. Web best practices - such as accessibility, design, and critical thinking about relevant ethics and organization. Covers practical skills to design and implement websites using popular scripting languages and frameworks, content management systems (CMSs), and related tools."
        },
        "298": {
            "title": "DIRECTED STUDY IN COMPUTER SCIENCE",
            "description": "Undergraduate directed study in computer sciences."
        },
        "300": {
            "title": "PROGRAMMING II",
            "description": "Introduction to Object-Oriented Programming using classes and objects to solve more complex problems. Introduces array-based and linked data structures: including lists, stacks, and queues. Programming assignments require writing and developing multi-class (file) programs using interfaces, generics, and exception handling to solve challenging real world problems. Topics reviewed include reading/writing data and objects from/to files and exception handling, and command line arguments. Topics introduced: object-oriented design; class vs. object; create and define interfaces and iterators; searching and sorting; abstract data types (List,Stack,Queue,PriorityQueue(Heap),Binary Search Tree); generic interfaces (parametric polymorphism); how to design and write test methods and classes; array based vs. linked node implementations; introduction to complexity analysis; recursion."
        },
        "304": {
            "title": "WES-CS GROUP MEETING",
            "description": "Small group meetings for Wisconsin Emerging Scholars - Computer Science (WES-CS) students. Meets in small groups to work together on problems related to theCOMP SCI 200course material. For information about WES-CS membership, contact the computer sciences department."
        },
        "310": {
            "title": "PROBLEM SOLVING USING COMPUTERS",
            "description": "Gives students an introduction to computer and analytical skills to use in their subsequent course work and professional development. Discusses several methods of using computers to solve problems, including elementary programming techniques, symbolic manipulation languages, and software packages. Techniques will be illustrated using sample problems drawn from elementary engineering. Emphasis is on introduction of algorithms with the use of specific tools to illustrate the methods."
        },
        "319": {
            "title": "DATA SCIENCE PROGRAMMING I FOR RESEARCH",
            "description": "Introduction to Data Science programming using Python. In addition to a survey of programming basics (control flow and data structures), web scraping, database queries, and tabular analysis will be introduced. Projects will emphasize analyzing real datasets in a variety of forms and visual communication using plotting tools. Similar toCOMP SCI 220but the pedagogical style of the projects will be adapted to graduate students in fields other than computer science and data science. No previous programming experience required."
        },
        "320": {
            "title": "DATA SCIENCE PROGRAMMING II",
            "description": "Intermediate approach to Data Science programming using Python. Experience with basic tabular analysis in Python is assumed. Learn to implement data structures (e.g., graphs) to efficiently represent datasets. Software-engineering tools such as version control and Python virtual environments will be introduced, with an emphasis on reproducibility of analysis. Tracing and A/B testing will be introduced as techniques for generating meaningful datasets. Introduces basic classification, clustering, optimization, and simulation techniques. Plotting and visual communication will be emphasized throughout the course."
        },
        "352": {
            "title": "DIGITAL SYSTEM FUNDAMENTALS",
            "description": "Logic components, Boolean algebra, combinational logic analysis and synthesis, synchronous and asynchronous sequential logic analysis and design, digital subsystems, computer organization and design."
        },
        "354": {
            "title": "MACHINE ORGANIZATION AND PROGRAMMING",
            "description": "An introduction to fundamental structures of computer systems and the C programming language with a focus on the low-level interrelationships and impacts on performance. Topics include the virtual address space and virtual memory, the heap and dynamic memory management, the memory hierarchy and caching, assembly language and the stack, communication and interrupts/signals, compiling and assemblers/linkers."
        },
        "368": {
            "title": "LEARNING A PROGRAMMING LANGUAGE",
            "description": "For students interested in learning a particular programming language. Focuses on a specific language offered at one of three levels: beginner, intermediate, and advanced. Students may repeat the course if the topic title is different."
        },
        "400": {
            "title": "PROGRAMMING III",
            "description": "The third course in our programming fundamentals sequence. It presumes that students understand and use functional and object-oriented design and abstract data types as needed. This course introduces balanced search trees, graphs, graph traversal algorithms, hash tables and sets, and complexity analysis and about classes of problems that require each data type. Students are required to design and implement using high quality professional code, a medium sized program, that demonstrates knowledge and use of latest language features, tools, and conventions. Additional topics introduced will include as needed for projects: inheritance and polymorphism; anonymous inner classes, lambda functions, performance analysis to discover and optimize critical code blocks. Students learn about industry standards for code development. Students will design and implement a medium size project with a more advanced user-interface design, such as a web or mobile application with a GUI and event- driven implementation; use of version-control software."
        },
        "402": {
            "title": "INTRODUCING COMPUTER SCIENCE TO K-12 STUDENTS",
            "description": "Work in teams to lead Computer Science clubs and workshops for K-12 students at sites in the Madison area. Design and lead activities to help K-12 students learn computational thinking and computer programming."
        },
        "403": {
            "title": "INTERNSHIP COURSE IN COMP SCI AND DATA SCIENCE",
            "description": "Enables students with outside internships to earn academic credit connected to their work experience related to the Computer Sciences or Data Science programs."
        },
        "407": {
            "title": "FOUNDATIONS OF MOBILE SYSTEMS AND APPLICATIONS",
            "description": "Design and implementation of applications, systems, and services for mobile platforms with (i) constraints, such as limited processing, memory, energy, interfaces, variable bandwidth, and high mobility, and (ii) features, such as touchscreens, cameras, electronic compasses, GPS, and accelerometers."
        },
        "412": {
            "title": "INTRODUCTION TO NUMERICAL METHODS",
            "description": "Interpolation, solution of linear and nonlinear systems of equations, approximate integration and differentiation, numerical solution of ordinary differential equations, Data fitting (such as least squares) by polynomials and splines. Knowledge of matrix algebra recommended, such asMATH 340."
        },
        "425": {
            "title": "INTRODUCTION TO COMBINATORIAL OPTIMIZATION",
            "description": "Focuses on optimization problems over discrete structures, such as shortest paths, spanning trees, flows, matchings, and the traveling salesman problem. We will investigate structural properties of these problems, and we will study both exact methods for their solution, and approximation algorithms."
        },
        "435": {
            "title": "INTRODUCTION TO CRYPTOGRAPHY",
            "description": "Cryptography is the art and science of transmitting digital information in a secure manner. Provides an introduction to its technical aspects."
        },
        "471": {
            "title": "INTRODUCTION TO COMPUTATIONAL STATISTICS",
            "description": "Classical statistical procedures arise where closed-form mathematical expressions are available for various inference summaries (e.g. linear regression; analysis of variance). A major emphasis of modern statistics is the development of inference principles in cases where both more complex data structures are involved and where more elaborate computations are required. Topics from numerical linear algebra, optimization, Monte Carlo (including Markov chain Monte Carlo), and graph theory are developed, especially as they relate to statistical inference (e.g., bootstrapping, permutation, Bayesian inference, EM algorithm, multivariate analysis)."
        },
        "475": {
            "title": "INTRODUCTION TO COMBINATORICS",
            "description": "Problems of enumeration, distribution, and arrangement. Inclusion-exclusion principle. Generating functions and linear recurrence relations. Combinatorial identities. Graph coloring problems. Finite designs. Systems of distinct representatives and matching problems in graphs. Potential applications in the social, biological, and physical sciences. Puzzles. Problem solving."
        },
        "502": {
            "title": "THEORY AND PRACTICE IN COMPUTER SCIENCE EDUCATION",
            "description": "Computer science educational pedagogy and general teaching practices. Practical experience gained through tutoring students. Knowledge of object-oriented programming required."
        },
        "506": {
            "title": "SOFTWARE ENGINEERING",
            "description": "Ideas and techniques for designing, developing, and modifying large software systems. Topics include software engineering processes; requirements and specifications; project team organization and management; software architectures; design patterns; testing and debugging; and cost and quality metrics and estimation. Students will work in large teams on a substantial programming project."
        },
        "513": {
            "title": "NUMERICAL LINEAR ALGEBRA",
            "description": "Direct and iterative solution of linear and nonlinear systems and of eigenproblems. LU and symmetric LU factorization. Complexity, stability, and conditioning. Nonlinear systems. Iterative methods for linear systems. QR-factorization and least squares. Eigenproblems: local and global methods."
        },
        "514": {
            "title": "NUMERICAL ANALYSIS",
            "description": "Polynomial forms, divided differences. Polynomial interpolation. Polynomial approximation: uniform approximation and Chebyshev polynomials, least-squares approximation and orthogonal polynomials. Numerical differentiation and integration. Splines, B-splines and spline approximation. Numerical methods for solving initial and boundary value problems for ordinary differential equations."
        },
        "518": {
            "title": "WEARABLE TECHNOLOGY",
            "description": "Gives students hands-on experience in building wearable computing platforms. Designed for students who have a background in textiles and apparel design, computer science, engineering or media arts. By the completion of the course students will have fundamental knowledge of electronic circuitry, programming, and \"maker skills\"."
        },
        "520": {
            "title": "INTRODUCTION TO THEORY OF COMPUTING",
            "description": "Basics about the notion, capabilities, and limitations of computation: elements of finite automata and regular languages, computability theory, and computational complexity theory. Additional topics include context-free grammars and languages, and complexity-theoretic cryptography."
        },
        "524": {
            "title": "INTRODUCTION TO OPTIMIZATION",
            "description": "Introduction to mathematical optimization from a modeling and solution perspective. Formulation of applications as discrete and continuous optimization problems and equilibrium models. Survey and appropriate usage of basic algorithms, data and software tools, including modeling languages and subroutine libraries."
        },
        "525": {
            "title": "LINEAR OPTIMIZATION",
            "description": "Introduces optimization problems whose constraints are expressed by linear inequalities. Develops geometric and algebraic insights into the structure of the problem, with an emphasis on formal proofs. Presents the theory behind the simplex method, the main algorithm used to solve linear optimization problems. Explores duality theory and theorems of the alternatives."
        },
        "526": {
            "title": "ADVANCED LINEAR PROGRAMMING",
            "description": "Review of linear programming. Polynomial time methods for linear programming. Quadratic programs and linear complementarity problems and related solution techniques. Solution sets and their continuity properties. Error bounds for linear inequalities and programs. Parallel algorithms for linear and quadratic programs."
        },
        "532": {
            "title": "MATRIX METHODS IN MACHINE LEARNING",
            "description": "Linear algebraic foundations of machine learning featuring real-world applications of matrix methods from classification and clustering to denoising and data analysis. Mathematical topics include: linear equations, regression, regularization, the singular value decomposition, and iterative algorithms. Machine learning topics include: the lasso, support vector machines, kernel methods, clustering, dictionary learning, neural networks, and deep learning. Previous exposure to numerical computing (e.g. Matlab, Python, Julia, R) required."
        },
        "533": {
            "title": "IMAGE PROCESSING",
            "description": "Mathematical representation of continuous and digital images; models of image degradation; picture enhancement, restoration, segmentation, and coding; pattern recognition, tomography."
        },
        "534": {
            "title": "COMPUTATIONAL PHOTOGRAPHY",
            "description": "Study of sensing and computational techniques that enhance or extend the capabilities of digital photography by using methods from computer vision and computer graphics to create new visual representations. Algorithms for analyzing, improving, manipulating, combining, and synthesizing images."
        },
        "536": {
            "title": "INTRODUCTION TO PROGRAMMING LANGUAGES AND COMPILERS",
            "description": "Introduction to the theory and practice of compiler design. Comparison of features of several programming languages and their implications for implementation techniques. Several programming projects required."
        },
        "537": {
            "title": "INTRODUCTION TO OPERATING SYSTEMS",
            "description": "Input-output hardware, interrupt handling, properties of magnetic tapes, discs and drums, associative memories and virtual address translation techniques. Batch processing, time sharing and real-time systems, scheduling resource allocation, modular software systems, performance measurement and system evaluation."
        },
        "538": {
            "title": "INTRODUCTION TO THE THEORY AND DESIGN OF PROGRAMMING LANGUAGES",
            "description": "Design and theory of programming languages: procedural, object-oriented, functional and logic paradigms. Serial and concurrent programming. Execution models and formal specification techniques."
        },
        "539": {
            "title": "INTRODUCTION TO ARTIFICIAL NEURAL NETWORKS",
            "description": "Theory and applications of artificial neural networks: multi-layer perceptron, self-organization mapdeep neural network convolutional neural network, recurrent network, support vector machines genetic algorithm, and evolution computing. Applications to control, pattern recognition, prediction, and object detection and tracking."
        },
        "540": {
            "title": "INTRODUCTION TO ARTIFICIAL INTELLIGENCE",
            "description": "Principles of knowledge-based search techniques, automatic deduction, knowledge representation using predicate logic, machine learning, probabilistic reasoning. Applications in tasks such as problem solving, data mining, game playing, natural language understanding, computer vision, speech recognition, and robotics."
        },
        "541": {
            "title": "THEORY & ALGORITHMS FOR DATA SCIENCE",
            "description": "Theoretical methods for data science. Topics include: review of probability background, concentration inequalities, geometry of high dimensional random variables, parametric and non-parametric estimation, selected topics from optimization (optimality conditions; deterministic and stochastic gradient descent), PAC learning, sample complexity and algorithms for linear classification and regression, and property/distribution testing. Uses Python programming language."
        },
        "542": {
            "title": "INTRODUCTION TO SOFTWARE SECURITY",
            "description": "Teaches the security considerations that occur during all steps of the software development life cycle: methodologies for designing secure software, programming using secure programming techniques, in-depth vulnerability assessment methodologies, static and dynamic analysis tools for evaluating software security, and system defenses reducing security threats."
        },
        "544": {
            "title": "INTRODUCTION TO BIG DATA SYSTEMS",
            "description": "Deploy and use distributed systems to store and analyze large datasets.  Unstructured and structured approaches to storage will be covered.  Analysis will involve learning new query languages, processing streaming data, and training machine learning models.  Most programming will be done in Python."
        },
        "552": {
            "title": "INTRODUCTION TO COMPUTER ARCHITECTURE",
            "description": "The design of computer systems and components. Processor design, instruction set design, and addressing; control structures and microprogramming; memory management, caches, and memory hierarchies; and interrupts and I/O structures.E C E 551or knowledge of Verilog is recommended."
        },
        "558": {
            "title": "INTRODUCTION TO COMPUTATIONAL GEOMETRY",
            "description": "Introduction to fundamental geometric computations and algorithms, and their use for solving engineering and scientific problems. Computer representations of simple geometric objects and paradigms for algorithm design. Applications from areas of engineering analysis, design and manufacturing, biology, statistics, and other sciences."
        },
        "559": {
            "title": "COMPUTER GRAPHICS",
            "description": "Survey of computer graphics. Image representation, formation, presentation, composition and manipulation. Modeling, transformation, and display of geometric objects in two and three dimensions. Representation of curves and surfaces. Rendering, animation, multi-media and visualization. Fluency with vector mathematics (e.g., fromMATH 234or a linear algebra class) is recommended."
        },
        "561": {
            "title": "PROBABILITY AND INFORMATION THEORY IN MACHINE LEARNING",
            "description": "Probabilistic tools for machine learning and analysis of real-world datasets. Introductory topics include classification, regression, probability theory, decision theory and quantifying information with entropy, relative entropy and mutual information. Additional topics include naive Bayes, probabilistic graphical models, discriminant analysis, logistic regression, expectation maximization, source coding and variational inference."
        },
        "564": {
            "title": "DATABASE MANAGEMENT SYSTEMS: DESIGN AND IMPLEMENTATION",
            "description": "What a database management system is; different data models currently used to structure the logical view of the database: relational, hierarchical, and network. Hands-on experience with relational and network-based database systems. Implementation techniques for database systems. File organization, query processing, concurrency control, rollback and recovery, integrity and consistency, and view implementation."
        },
        "565": {
            "title": "INTRODUCTION TO DATA VISUALIZATION",
            "description": "Introduction to topics such as perception, cognition, communication, design, implementation, applications, tools, and evaluation. Provides a broad survey of the field  and covers fundamental concepts, theory, and tools in data visualization with opportunities for hands-on activities. Gain real-world experience in designing and evaluating visualizations."
        },
        "566": {
            "title": "INTRODUCTION TO COMPUTER VISION",
            "description": "Topics include image formation, feature detection, motion estimation, image mosaics, 3D shape reconstruction, and object recognition. Applications of these techniques include building 3D maps, creating virtual characters, organizing photo and video databases, human computer interaction, video surveillance, and automatic vehicle navigation. Broad overview of various computer vision and machine learning techniques and sensing and imaging technologies used in computer vision applications. This is a project-based course."
        },
        "567": {
            "title": "MEDICAL IMAGE ANALYSIS",
            "description": "Present introductory medical image processing and analysis techniques. Topics include medical imaging formats, segmentation, registration, image quantification, classification.  Strongly encourage Matlab experience, such asCOMP SCI 310or368-Matlab."
        },
        "570": {
            "title": "INTRODUCTION TO HUMAN-COMPUTER INTERACTION",
            "description": "User-centered software design; (1) principles of and methods for understanding user needs, designing and prototyping interface solutions, and evaluating their usability, (2) their applications in designing web-based, mobile,and embodied interfaces through month long group projects.  Meets with Comp Sci 270."
        },
        "571": {
            "title": "BUILDING USER INTERFACES",
            "description": "Introduces software development of user interfaces (UIs).  Build competence in implementing UIs using state-of-the-art (1) UI paradigms, such as event-driven interfaces, direct-manipulation interfaces, and dialogue-based interaction; (2) methods for capturing, interpreting, and responding to different forms of user input and states, including pointing, text entry, speech, touch, gestures, user activity, context, and physiological states; and (3) platform-specific UI development APIs, frameworks, and toolkits for multiple platforms including web/mobile/desktop interfaces, natural user interfaces, and voice user interfaces. Learn about the fundamental concepts, technologies, algorithms, and methods in building user interfaces, implement UIs using of state-of-the-art UI development tools, and build a UI development portfolio."
        },
        "576": {
            "title": "INTRODUCTION TO BIOINFORMATICS",
            "description": "Algorithms for computational problems in molecular biology. Studies algorithms for problems such as: genome sequencing and mapping, pairwise and multiple sequence alignment, modeling sequence classes and features, phylogenetic tree construction, and gene-expression data analysis."
        },
        "577": {
            "title": "INTRODUCTION TO ALGORITHMS",
            "description": "Basic paradigms for the design and analysis of efficient algorithms: greed, divide-and-conquer, dynamic programming, reductions, and the use of randomness. Computational intractability including typical NP-complete problems and ways to deal with them."
        },
        "578": {
            "title": "CONTEST-LEVEL PROGRAMMING",
            "description": "Training in computer programming for competitions: assessing the coding difficulty and complexity of computational problems, recognizing the applicability of known algorithms, fast coding and testing, team work.COMP SCI 577is suggested but not required."
        },
        "579": {
            "title": "VIRTUAL REALITY",
            "description": "Introduces students to the field of virtual reality and focuses on creating immersive, interactive virtual experiences. Survey topics include historical perspectives on virtual reality technology, computer graphics and 3D modeling, human perception and psychology, human computer interaction and user interface design. This course is designed for students with backgrounds in Computer Science, Engineering, Art, Architecture and Design. Students will work in interdisciplinary teams on projects, culminating in a final event that will be showcased to the public. While not an official uisite, the class will be technologically motivated; therefore students should be comfortable learning new software. The class will utilize publicly available game design software which provides tools and services for the creation of interactive content. While not necessary, students may find it helpful to have taken classes in programming and computer graphics (suchCOMP SCI 559: Computer Graphics) or in 3D modeling (such asART 429: 3D Digital Studio I orDS 242: Visual Communication II)."
        },
        "611": {
            "title": "USER EXPERIENCE DESIGN 1",
            "description": "Introduction to the user experience design including key stages of the design process, design ethics, and the methods and tools involved at each stage of design.  Conduct formative research on clients, users, use contexts and tasks. Gain experience with user research methodologies and learn to create intermediate design tools such as personas. Develop and present a design proposal for a chosen project."
        },
        "612": {
            "title": "USER EXPERIENCE DESIGN 2",
            "description": "Advanced study of UX design. Introduces processes of ideation, key concepts of visual design, conceptual and interaction design, low and high-resolution prototyping of design techniques. Applications include drafting designs based on user models and initial testing of prototypes."
        },
        "613": {
            "title": "USER EXPERIENCE DESIGN 3",
            "description": "Conduct formal evaluations of the user experience (UX) or usability of a digital system. Gain familiarity with the evaluation and research process including key stages, tasks for each stage, common data collection and analysis methods, and common tools employed in the field. Gain experience with a variety of UX evaluation approaches. Collect pilot data and develop a proposal for further UX testing."
        },
        "614": {
            "title": "USER EXPERIENCE DESIGN CAPSTONE",
            "description": "Applies a design studio critique approach to produce a learning environment of collaborative and interdisciplinary peer critique and learning, in addition to provide expert feedback and suggestions. Present and defend the latest iteration of the user experience design project developed in earlier courses while learning about the professions associated with digital user experience design."
        },
        "635": {
            "title": "TOOLS AND ENVIRONMENTS FOR OPTIMIZATION",
            "description": "Formulation and modeling of applications from computer sciences, operations research, business, science and engineering involving optimization and equilibrium models. Survey and appropriate usage of software tools for solving such problems, including modeling language use, automatic differentiation, subroutine libraries and web-based optimization tools and environments."
        },
        "638": {
            "title": "UNDERGRADUATE TOPICS IN COMPUTING",
            "description": "Selected topics in computing. Each offering of the course will cover a topic selected by the instructor and may cover one or more topics from all of computer science."
        },
        "639": {
            "title": "UNDERGRADUATE ELECTIVE TOPICS IN COMPUTING",
            "description": "Selected topics in computing. Each offering of the course will cover a topic selected by the instructor. Offerings of this course will provide sufficient depth into their subject to count as electives to meet CS Major requirements."
        },
        "640": {
            "title": "INTRODUCTION TO COMPUTER NETWORKS",
            "description": "Architecture of computer networks and network protocols, protocol layering, reliable transmission, congestion control, flow control, naming and addressing, unicast and multicast routing, network security, network performance widely used protocols such as Ethernet, wireless LANs, IP, TCP, and HTTP."
        },
        "642": {
            "title": "INTRODUCTION TO INFORMATION SECURITY",
            "description": "Senior level undergraduate course covering various topics on information security. Covers a wide range of topics, such as cryptographic primitives, security protocols, system security, and emerging topics.  Elementary knowledge of mathematical logic and discrete probability theory needed, such asMATH/​COMP SCI  240."
        },
        "681": {
            "title": "SENIOR HONORS THESIS",
            "description": "Individual study for seniors completing theses for honors in the Computer Sciences major as arranged with a faculty member."
        },
        "682": {
            "title": "SENIOR HONORS THESIS",
            "description": "Individual study for seniors completing theses for honors in the Computer Sciences major as arranged with a faculty member. Continuation ofCOMP SCI 681"
        },
        "691": {
            "title": "SENIOR THESIS",
            "description": "Individual study for seniors completing theses as arranged with a faculty member."
        },
        "692": {
            "title": "SENIOR THESIS",
            "description": "Individual study for seniors completing theses as arranged with a faculty member, continuation ofCOMP SCI 691"
        },
        "698": {
            "title": "DIRECTED STUDY",
            "description": "Directed study projects for juniors and seniors as arranged with a faculty member."
        },
        "699": {
            "title": "DIRECTED STUDY",
            "description": "Directed study projects for juniors and seniors as arranged with a faculty member."
        },
        "701": {
            "title": "CONSTRUCTION OF COMPILERS",
            "description": "Principles of the design and implementation of programming languages. Topics include: Principles of compilation, static program analysis, compilation methods to support profiling, and code-generation methods. Knowledge of programming languages and compiler design strongly encouraged, such asCOMP SCI 536."
        },
        "702": {
            "title": "GRADUATE COOPERATIVE EDUCATION",
            "description": "A full-time cooperative experience (10 or 5 week option) in computer science in a commercial, government, or nonprofit setting, usually in the form of an internship. The work will be monitored by a graduate advisor from the faculty of the Department of Computer Sciences.  10 week option for 2 credits, 5 week option for 1 credit."
        },
        "703": {
            "title": "PROGRAM VERIFICATION AND SYNTHESIS",
            "description": "Formal methods for program verification. Model-checking techniques; linear temporal logic; computational tree logic; logic/automata connection; bisimulations; probabilistic model-checking. Special topics include: program synthesis, verification and synthesis of privacy properties. Knowledge of programming languages and compiler design strongly encouraged, such asCOMP SCI 536."
        },
        "704": {
            "title": "PRINCIPLES OF PROGRAMMING LANGUAGES",
            "description": "Introduction to principles of advanced programming languages and programming-language theory. Topics include: lambda-calculus, functional languages, polymorphic functions, type inference, structural induction, lazy evaluation, operational semantics, denotational semantics, and axiomatic semantics. Students are strongly encouraged to have knowledge of programming languages, such as fromCOMP SCI 536."
        },
        "706": {
            "title": "ANALYSIS OF SOFTWARE ARTIFACTS",
            "description": "Advanced course covering various analysis techniques used in software engineering. Covers techniques for analyzing various software artifacts. Some of the topics that will be covered are: model checking, testing, program analysis, requirements analysis, and safety analysis. Students are strongly encouraged to have knowledge of programming languages and compiler design, such asCOMP SCI 536, and a basic knowledge of mathematical logic."
        },
        "707": {
            "title": "MOBILE AND WIRELESS NETWORKING",
            "description": "Design and implementation of protocols, systems, and applications for mobile and wireless networking, particularly at the media access control, network, transport, and application layers. Focus is on the unique problems and challenges presented by the properties of wireless transmission, various device constraints such as limited battery power, and node mobility. Knower of computer networking is strongly encouraged, such as fromCOMP SCI 640orE C E 537."
        },
        "710": {
            "title": "COMPUTATIONAL COMPLEXITY",
            "description": "Study of the capabilities and limitations of efficient computation. Relationships between models representing capabilities such as parallelism, randomness, quantum effects, and non-uniformity; and models based on the notions of nondeterminism, alternation, and counting, which capture the complexity of important problems.  Knowledge of the theory of computation is strongly encouraged, such asCOMP SCI 520."
        },
        "714": {
            "title": "METHODS OF COMPUTATIONAL MATHEMATICS I",
            "description": "Development of finite difference methods for hyperbolic, parabolic and elliptic partial differential equations. Analysis of accuracy and stability of difference schemes. Direct and iterative methods for solving linear systems. Introduction to finite volume methods. Applications from science and engineering. Students are strongly encouraged to have programming skills (e.g.COMP SCI 200) and some undergraduate numerical analysis (e.g.MATH/​COMP SCI  514orCOMP SCI 412), analysis and differential equations (e.g.MATH 322andMATH 521) and linear algebra (e.g.MATH 341)."
        },
        "715": {
            "title": "METHODS OF COMPUTATIONAL MATHEMATICS II",
            "description": "Introduction to spectral methods (Fourier, Chebyshev, Fast Fourier Transform), finite element methods (Galerkin methods, energy estimates and error analysis), and mesh-free methods (Monte-Carlo, smoothed-particle hydrodynamics) for solving partial differential equations. Applications from science and engineering. Applications from science and engineering. Students are strongly encouraged to have programming skills (e.g.COMP SCI 200), undergraduate numerical analysis (e.g.MATH/​COMP SCI  514orCOMP SCI 412), analysis (MATH 322and521) and linear algebra (e.g.MATH 341or equiv.)"
        },
        "719": {
            "title": "STOCHASTIC PROGRAMMING",
            "description": "Stochastic programming is concerned with decision making in the presence of uncertainty, where the eventual outcome depends on a future random event. Topics include modeling uncertainty in optimization problems, risk measures, stochastic programming algorithms, approximation and sampling methods, and applications.  Students are strongly encouraged to have knowledge of linear programming (e.g.,MATH/​COMP SCI/​I SY E/​STAT  525) and probability and statistics (e.g.,MATH/​STAT  431). Knowledge of integer optimization (MATH/​COMP SCI/​I SY E  728) is helpful, but not required."
        },
        "722": {
            "title": "COMPUTATIONAL OPTICS AND IMAGING",
            "description": "Computational imaging includes all imaging methods that produce images as a result of computation on collected signals. Learn the tools to design new computational imaging methods to solve specific imaging problems. Provides an understanding of the physics of light propagation and measurement, and the computational tools to model it, including wave propagation, ray tracing, the radon transform, and linear algebra using matrix and integral operators and the computational tools to reconstruct an image, including linear inverse problems, neural networks, convex optimization, and filtered back-projection. Covers a variety of example computational imaging techniques and their applications including coded apertures, structured illumination, digital holography, computed tomography, imaging through scattering media, compressed sensing, and non-line-of-sight imaging."
        },
        "723": {
            "title": "DYNAMIC PROGRAMMING AND ASSOCIATED TOPICS",
            "description": "General and special techniques of dynamic programming developed by means of examples. Shortest-path algorithms. Deterministic equipment replacement models. Resource allocation problem. Traveling-salesman problem. Knapsack problem. Analysis of inventory systems. General stochastic formulations. Markovian decision processes.  Students are strongly encouraged to have knowledge of mathematical optimization (e.g.,COMP SCI/​I SY E/​MATH/​STAT  525, I SY E 623,COMP SCI/​I SY E/​MATH/​STAT  726), knowledge of analysis (e.g.,MATH/​STAT  431or521) and programming ability (e.g.,COMP SCI 200or 301)"
        },
        "726": {
            "title": "NONLINEAR OPTIMIZATION I",
            "description": "Theory and algorithms for nonlinear optimization, focusing on unconstrained optimization. Line-search and trust-region methods; quasi-Newton methods; conjugate-gradient and limited-memory methods for large-scale problems; derivative-free optimization; algorithms for least-squares problems and nonlinear equations; gradient projection algorithms for bound-constrained problems; and simple penalty methods for nonlinearly constrained optimization. Students are strongly encouraged to have knowledge of linear algebra and familiarity with basic mathematical analysis."
        },
        "727": {
            "title": "CONVEX ANALYSIS",
            "description": "Convex sets in finite-dimensional spaces: relative interiors, separation, set operations. Convex functions: conjugacy, subdifferentials and directional derivations, functional operations, Fenchel-Rockafellar duality. Applications to operations research and related areas.  Students taking this course are strongly encouraged to have had a course in basic analysis (e.g.MATH 521) and a course in linear algebra (e.g.,MATH 340)."
        },
        "728": {
            "title": "INTEGER OPTIMIZATION",
            "description": "Introduces optimization problems over integers, and surveys the theory behind the algorithms used in state-of-the-art methods for solving such problems. Special attention is given to the polyhedral formulations of these problems, and to their algebraic and geometric properties. Applicability of Integer Optimization is highlighted with applications in combinatorial optimization. Key topics include: formulations, relaxations, polyhedral theory, cutting planes, decomposition, enumeration.  Students are strongly encouraged to have knowledge of Linear Programming  (e.g.,MATH/​COMP SCI/​I SY E/​STAT  525), including algorithms, duality and polyhedral theory."
        },
        "730": {
            "title": "NONLINEAR OPTIMIZATION II",
            "description": "Theory and algorithms for nonlinearly constrained optimization. Relevant geometric concepts, including tangent and normal cones, theorems of the alternative, and separation results. Constraint qualifications. Geometric and algebraic expression of first-order optimality conditions. Second-order optimality conditions. Duality. Nonlinear  programming algorithms: merit functions and filters; interior-point, augmented Lagrangian, and sequential quadratic programming algorithms."
        },
        "736": {
            "title": "ADVANCED OPERATING SYSTEMS",
            "description": "Advanced topics in operating systems, including process communication, resource allocation, multiprocess and network operating systems, kernel philosophies, fault-tolerant systems, virtual machines, high-level language systems, verifiability and proof techniques. Comp Sci 537 or cons inst"
        },
        "739": {
            "title": "DISTRIBUTED SYSTEMS",
            "description": "Basic concepts; distributed programming; distributed file systems; atomic actions; fault tolerance, transactions, program and data replication, recovery; distributed machine architectures; security and authentication; load balancing and process migration; distributed debugging; distributed performance measurement; distributed simulation techniques; distributed applications; correctness considerations and proof systems."
        },
        "740": {
            "title": "ADVANCED COMPUTER NETWORKS",
            "description": "Advanced topics in computer communications networks: congestion and flow control; routing; rate-based protocols; high speed interfaces and technologies: metropolitan area networks; fast packet switching technologies; advanced applications; network services: name service, authentication, resource location.  Students are strongly encouraged to have knowledge of computer network design and protocols (e.g.,COMP SCI 640)"
        },
        "744": {
            "title": "BIG DATA SYSTEMS",
            "description": "Issues in the design and implementation of big data processing systems, including: an overview of cluster architecture, key design goals (flexibility, performance and fault tolerance), popular execution frameworks, basic abstractions, and applications (e.g., batch analytics, stream processing, graph processing, and machine learning)."
        },
        "750": {
            "title": "REAL-TIME COMPUTING SYSTEMS",
            "description": "Introduction to the unique issues in the design and analysis of computer systems for real-time applications. Hardware and software support for guaranteeing timeliness with and without failures. Resource management, time-constrained communication, scheduling and imprecise computations, real-time kernels and case studies.  Students are strongly encouraged to have knowledge of computer architecture (e.g.,E C E/​COMP SCI  552) and operating system functions (e.g.,COMP SCI 537)"
        },
        "752": {
            "title": "ADVANCED COMPUTER ARCHITECTURE I",
            "description": "Processor design, computer arithmetic, pipelining, multi-operation processors, vector processors, control units, precise interrupts, main memory, cache memories, instruction set design, stack machines, busses and I/O, protection and security.  Students are strongly encouraged to have knowledge of computer architecture (e.g.,E C E/​COMP SCI  552)."
        },
        "755": {
            "title": "VLSI SYSTEMS DESIGN",
            "description": "Overview of MOS devices and circuits; introduction to integrated circuit fabrication; topological design of data flow and control; interactive graphics layout; circuit simulation; system timing; organizational and architectural considerations; alternative implementation approaches; design project.E C E 555or equivalent experience is strongly recommended."
        },
        "756": {
            "title": "COMPUTER-AIDED DESIGN FOR VLSI",
            "description": "Broad introduction to computer-aided design tools for VLSI, emphasizing implementation algorithms and data structures. Topics covered: design styles, layout editors, symbolic compaction, module generators, placement and routing, automatic synthesis, design-rule checking, circuit extraction, simulation and verification.  Students are strongly encourage to have programming skills and to  have taken a course in Digital System Fundamentals such asE C E/​COMP SCI  352."
        },
        "757": {
            "title": "ADVANCED COMPUTER ARCHITECTURE II",
            "description": "Parallel algorithms, principles of parallelism detection and vectorizing compilers, interconnection networks, MIMD machines, processor synchronization, data coherence, multis, dataflow machines, special purpose processors.  Students are strongly encouraged to have knowledge of computer architecture (e.g.,E C E/​COMP SCI  552)."
        },
        "758": {
            "title": "ADVANCED TOPICS IN COMPUTER ARCHITECTURE",
            "description": "Advanced topics in computer architecture that explore the implications to architecture of forthcoming evolutionary and revolutionary changes in application demands, software paradigms, and hardware implementation technologies.  Students are strongly encouraged to have knowledge of computer architecture (e.g.,E C E/​COMP SCI  552)."
        },
        "759": {
            "title": "HIGH PERFORMANCE COMPUTING FOR APPLICATIONS IN ENGINEERING",
            "description": "An overview of hardware and software solutions that enable the use of advanced computing in tackling computationally intensive Engineering problems. Hands-on learning promoted through programming assignments that leverage emerging hardware architectures and use parallel computing programming languages. Students are strongly encourage to have completed COMP SCI 367 orCOMP SCI 400or to have equivalent experience."
        },
        "760": {
            "title": "MACHINE LEARNING",
            "description": "Computational approaches to learning: including inductive inference, explanation-based learning, analogical learning, connectionism, and formal models. What it means to learn. Algorithms for learning. Comparison and evaluation of learning algorithms. Cognitive modeling and relevant psychological results."
        },
        "761": {
            "title": "MATHEMATICAL FOUNDATIONS OF MACHINE LEARNING",
            "description": "Mathematical foundations of machine learning theory and algorithms. Probabilistic, algebraic, and geometric models and representations of data, mathematical analysis of state-of-the-art learning algorithms and optimization methods, and applications of machine learning. Knowledge of probability [such asMATH/​STAT  431orCOMP SCI/​E C E  561] and linear algebra [such asMATH 341orM E/​COMP SCI/​E C E  532] is required."
        },
        "762": {
            "title": "ADVANCED DEEP LEARNING",
            "description": "Explore methods and applications of deep learning. Covers cutting-edge topics, including neural architecture design, robustness and reliability of deep learning, learning with less supervision, lifelong machine learning, deep generative modeling, theoretical understanding of deep learning, and interpretable deep learning."
        },
        "763": {
            "title": "SECURITY AND PRIVACY FOR DATA SCIENCE",
            "description": "Security and privacy concerns in data science. Three core subjects will be considered: Differential privacy and algorithmic fairness; Adversarial machine learning; and Applied cryptography, especially with applications to machine learning. In addition, a selection of more advanced topics will be covered. Possible examples include additional notions of privacy, language-based security, robust optimization. A firm grasp of probability/statistics (STAT/​MATH  431) is recommended. Previous exposure to at least one of cryptography (COMP SCI/​E C E/​MATH  435), security (COMP SCI 642), and modern machine learning (COMP SCI/​E C E/​M E  539or540) is also recommended."
        },
        "764": {
            "title": "TOPICS IN DATABASE MANAGEMENT SYSTEMS",
            "description": "Implementation of database management systems, the impact of new technology on database management systems, back-end database computers, distributed database management systems, concurrency control, and query execution in both distributed and centralized systems, implementation of multiple user views, roll-back and recovery mechanisms, database translation. Students are strongly encouraged to have knowledge of database design (e.g.,COMP SCI 564)."
        },
        "765": {
            "title": "DATA VISUALIZATION",
            "description": "Principles of the visual presentation of data. Survey of Information Visualization, Scientific Visualization, and Visual Analytics. Design and evaluation of visualizations and interactive exploration tools. Introduction to relevant foundations in visual design, human perception, and data analysis. Encodings, layout and interaction. Approaches to large data sets. Visualization of complex data types such as scalar fields, graphs, sets, texts, and multi-variate data. Use of 2D, 3D and motion in data presentations. Implementation issues."
        },
        "766": {
            "title": "COMPUTER VISION",
            "description": "Fundamentals of image analysis and computer vision; image acquisition and geometry; image enhancement; recovery of physical scene characteristics; shape-from techniques; segmentation and perceptual organization; representation and description of two-dimensional objects; shape analysis; texture analysis; goal-directed and model-based systems; parallel algorithms and special-purpose architectures. Students are strongly encouraged to have basic proficiency in calculus and linear algebra, such asMATH 340, and basic programming such asCOMP SCI 300."
        },
        "767": {
            "title": "COMPUTATIONAL METHODS FOR MEDICAL IMAGE ANALYSIS",
            "description": "Study of computational techniques that facilitate automated analysis, manipulation, denoising, and improvement of large-scale and high resolution medical images. Design and implementation of methods from computer Vision and Machine Learning to efficiently process such image data to answer biologically and clinically meaningful scientific questions. Students are strongly encouraged to have programming skills and basic proficiency in calculus and linear algebra, such asMATH 340."
        },
        "769": {
            "title": "ADVANCED NATURAL LANGUAGE PROCESSING",
            "description": "Develop algorithms and mathematical models for natural language processing tasks, including text categorization, information retrieval, speech recognition, machine translation, and information extraction. Focus is on the state-of-the-art computational techniques as they are applied to natural language tasks.  Students are strongly encouraged to have knowledge of introductory artificial intelligence (e.g.,COMP SCI 540)."
        },
        "770": {
            "title": "HUMAN-COMPUTER INTERACTION",
            "description": "Principles of human-computer interaction (HCI); human subjects research methods and procedures, qualitative and quantitative data analysis; and semester-long research project situated in critical domains of HCI, including applications in ubiquitous, affective, assistive, social, and embodied computing."
        },
        "771": {
            "title": "LEARNING BASED METHODS FOR COMPUTER VISION",
            "description": "Addresses the problems of representation and reasoning for large amounts of visual data, including images and videos, medical imaging data, and their associated tags or text descriptions. Introduces deep learning in the context of computer vision. Covers topics on visual recognition using deep models, such as image classification, object detection, human pose estimation, action recognition, 3D understanding, and medical image analysis. Emphasizes the design of vision and learning algorithms and models, as well as their practical implementations. Strongly recommended to have knowledge in computer vision or machine learning [such asCOMP SCI 540] or medical image analysis [such as B M I /COMP SCI/​B M I  567]."
        },
        "774": {
            "title": "DATA EXPLORATION, CLEANING, AND INTEGRATION FOR DATA SCIENCE",
            "description": "Big Data is often said to deal with four Vs: volume, velocity, variety, and veracity. The focus is on variety and veracity challenges, which often arise in data science projects. In many such projects, data is often incorrect, hard to understand, and come from a variety of sources. Data scientists often spend 80% of their effort to explore, clean, and integrate this data, before analysis can be carried out to extract insights. As a result, managing variety and veracity has received significant attention. Study these topics, understand their challenges, and discuss solutions. These solutions often require data management, machine learning, big data scaling, cloud, crowdsourcing, and user interaction techniques. Knowledge of machine learning/AI [COMP SCI 540], databases [COMP SCI 564] and Python [COMP SCI 320] recommended."
        },
        "775": {
            "title": "COMPUTATIONAL NETWORK BIOLOGY",
            "description": "Introduces networks as a powerful representation in many real-world domains including biology and biomedicine. Encompasses theory and applications of networks, also referred to as graphs, to study complex systems such as living organisms. Surveys the current literature on computational, graph-theoretic approaches that use network algorithms for biological modeling, analysis, interpretation, and discovery. Enables hands-on experience in network biology by implementing computational projects."
        },
        "776": {
            "title": "ADVANCED BIOINFORMATICS",
            "description": "Advanced course covering computational problems in molecular biology. The course will study algorithms for problems such as: modeling sequence classes and features, phylogenetic tree construction, gene-expression data analysis, protein and RNA structure prediction, and whole-genome analysis and comparisons."
        },
        "782": {
            "title": "ADVANCED COMPUTER SECURITY AND PRIVACY",
            "description": "Security and privacy issues in software, networks, and hardware systems. Security vulnerabilities, privacy threats, threats modeling, and mitigation strategies. Privacy issues related to user interaction with devices, online systems, and networks. In addition, a selection of more advanced topics will be covered. Possible examples include applied cryptography in the context of systems, security and privacy policies, user authentication, and cyber-physical systems. Builds on prior experiences with one or more of the following: networking, security, modern machine learning, embedded systems, and mobile computing."
        },
        "784": {
            "title": "FOUNDATIONS OF DATA MANAGEMENT",
            "description": "Foundational concepts in databases and data management. The first part of the course discusses topics on query languages (conjunctive queries, Datalog), their expressivity and complexity of evaluation. The second part studies advanced topics in modern data management, including data streams, massive parallelism, provenance, uncertain data management and privacy. There are no specific course prerequisites. It is strongly encouraged that the students are familiar with databases and relational algebra (COMP SCI 564or equivalent). Knowledge of algorithms, complexity theory and probability will also be helpful."
        },
        "787": {
            "title": "ADVANCED ALGORITHMS",
            "description": "Advanced paradigms for the design and analysis of efficient algorithms, including the use of randomness, linear programming, and semi-definite programming. Applications to data structures, approximating NP-hard optimization problems, learning, on-line and distributed problems.  Students are strongly encouraged to have introductory knowledge of algorithms (e.g.,COMP SCI 577)"
        },
        "790": {
            "title": "MASTER'S THESIS",
            "description": "Grad st; Master's candidates only"
        },
        "799": {
            "title": "MASTER'S RESEARCH",
            "description": ""
        },
        "809": {
            "title": "MATHEMATICAL TECHNIQUES IN THE ANALYSIS OF ALGORITHMS",
            "description": "Techniques for quantitative analysis of algorithms. Charging arguments, amortization, probabilistic methods. Adversary and information lower bounds. Use of methods from combinatorics, complex analysis, and asymptotics in obtaining precise analyses of quicksort, chained hashing, and other algorithms.  Students are strongly encouraged to have knowledge of algorithms (e.g.,COMP SCI 577) or applied math analysis (e.g.,MATH 321) and theory of probability (e.g.,MATH/​STAT  431)."
        },
        "812": {
            "title": "ARITHMETIC ALGORITHMS",
            "description": "Survey of algorithms and design paradigms for exact arithmetic, as used in public-key cryptography, computer algebra, and pseudo-random number generation. Topics include primality testing, factorization of integers and polynomials, discrete logarithms, and (optionally) elliptic curves and integer lattices.  Students are strongly encourage to have knowledge of basic abstract algebra (e.g.,MATH 541), and intermediate programming ability (e.g., COMP SCI 367 orCOMP SCI 300)."
        },
        "838": {
            "title": "TOPICS IN COMPUTING",
            "description": "Advanced topics of special interest to students in various areas of Computer Science. Each offering of the course will cover a topic selected by the instructor. Credit varies by offering - check with the department to determine how an offering counts toward degree requirements."
        },
        "839": {
            "title": "CORE TOPICS IN COMPUTING",
            "description": "Topics selected from advanced areas."
        },
        "841": {
            "title": "COMPUTATIONAL COGNITIVE SCIENCE",
            "description": "Studies the biological and computational basis of intelligence, by combining methods from cognitive science, artificial intelligence, machine learning, computational biology, and cognitive neuroscience. Requires ability to program."
        },
        "861": {
            "title": "THEORETICAL FOUNDATIONS OF MACHINE LEARNING",
            "description": "Advanced mathematical theory and methods of machine learning. Statistical learning theory, Vapnik-Chevronenkis Theory, model selection, high-dimensional models, nonparametric methods, probabilistic analysis, optimization, learning paradigms."
        },
        "880": {
            "title": "TOPICS IN THEORETICAL COMPUTER SCIENCE",
            "description": "Advanced topics in algorithms, complexity, and cryptography. The exact topic varies."
        },
        "899": {
            "title": "PRE-DISSERTATOR RESEARCH",
            "description": "Independent research supervised by a faculty member for students who have completed a master's degree but have not reached dissertator status."
        },
        "900": {
            "title": "ADVANCED SEMINAR IN COMPUTER SCIENCE",
            "description": "Seminar on recent research on various aspects of computer science."
        },
        "915": {
            "title": "COMPUTATION AND INFORMATICS IN BIOLOGY AND MEDICINE",
            "description": "Participants and outside speakers will discuss current research in computation and informatics in biology and medicine. This seminar is required of all CIBM program trainees."
        },
        "990": {
            "title": "DISSERTATION",
            "description": "Advanced level mentored reading and research for students with dissertator status."
        },
        "999": {
            "title": "DISSERTATOR RESEARCH",
            "description": "Advanced level mentored reading and research for dissertators."
        }
    },
    "MATH": {
        "96": {
            "title": "PREPARATORY ALGEBRA",
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit."
        },
        "112": {
            "title": "ALGEBRA",
            "description": "Properties of elementary functions, such as polynomial, absolute value, radical, rational, exponential, and logarithmic functions. Topics include equations, inequalities, functions, and their graphs. Students will formulate, analyze, solve, and interpret mathematical and real-world problems. Intended to provide the algebra skills required for calculus."
        },
        "113": {
            "title": "TRIGONOMETRY",
            "description": "Covers the graphs, properties and geometric significance of trigonometric functions of a real variable. Other topics include trigonometric equations and identities, application, trigonometric form of complex numbers, DeMoivre's theorem, and polar and parametric equations. The course also has a significant number of applications, especially related to other disciplines."
        },
        "114": {
            "title": "ALGEBRA AND TRIGONOMETRY",
            "description": "The two semester sequenceMATH 112-MATH 113covers similar material asMATH 114, but in a slower pace. Not recommended for students with less than an AB inMATH 96."
        },
        "118": {
            "title": "SUMMER COLLEGIATE EXPERIENCE MATHEMATICS COURSE",
            "description": "A preparation and introductory math course for students enrolled in the Summer Collegiate Experience program. Includes material from precalculus and calculus and related topics depending on students' results on the math placement exam."
        },
        "141": {
            "title": "QUANTITATIVE REASONING AND PROBLEM SOLVING",
            "description": "Develops a habit of mind, competency, and comfort in working with numerical data. Learn to reason and solve quantitative problems from a wide array of authentic contexts and everyday life situations, develop the ability to reason mathematically, and make and evaluate logical arguments supported by quantitative evidence. This course is for students who need to satisfy part A of the Quantitative Reasoning requirement and prepare for QR-B courses, but do not want to continue in the calculus sequence."
        },
        "171": {
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY I",
            "description": "Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Part of a 2-semester sequence withMATH 217; these two courses together are equivalent toMATH 114and221."
        },
        "198": {
            "title": "DIRECTED STUDY",
            "description": "Directed study projects as arranged with a faculty member."
        },
        "207": {
            "title": "TOPICS IN MATHEMATICS STUDY ABROAD",
            "description": "Credit is awarded to students who have completed an appropriate math course abroad at the intermediate level having no direct equivalence within the math department offerings. The study abroad course must be pre-approved by the math department."
        },
        "211": {
            "title": "SURVEY OF CALCULUS",
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221"
        },
        "213": {
            "title": "CALCULUS AND INTRODUCTION TO DIFFERENTIAL EQUATIONS",
            "description": "Techniques of integration, multiple integrals, infinite sequences and series, first order differential equations, two-dimensional systems of differential equations, difference equations, with models from and applications in business and the social and biological sciences."
        },
        "217": {
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY II",
            "description": "Continuation ofMATH 171. Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Completion ofMATH 217implies completion ofMATH 221and114."
        },
        "221": {
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1",
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions."
        },
        "222": {
            "title": "CALCULUS AND ANALYTIC GEOMETRY 2",
            "description": "Techniques of integration, improper integrals, first order ordinary differential equations, sequences and series, Taylor series, vector geometry in two and three dimensions."
        },
        "228": {
            "title": "WES CALCULUS SUPPLEMENT",
            "description": "Topics in algebra, trigonometry, differential, integral and multi-variable calculus and analytic geometry will be covered depending on which calculus courseMATH 228is attached to.MATH 228must be taken in conjunction with the appropriate WES section ofMATH 171,217,221,222, or234."
        },
        "234": {
            "title": "CALCULUS--FUNCTIONS OF SEVERAL VARIABLES",
            "description": "Introduction to calculus of functions of several variables; calculus on parameterized curves, derivatives of functions of several variables, multiple integrals, vector calculus."
        },
        "240": {
            "title": "INTRODUCTION TO DISCRETE MATHEMATICS",
            "description": "Basic concepts of logic, sets, partial order and other relations, and functions. Basic concepts of mathematics (definitions, proofs, sets, functions, and relations) with a focus on discrete structures: integers, bits, strings, trees, and graphs.  Propositional logic, Boolean algebra, and predicate logic. Mathematical induction and recursion. Invariants and algorithmic correctness. Recurrences and asymptotic growth analysis. Fundamentals of counting."
        },
        "298": {
            "title": "DIRECTED STUDY IN MATHEMATICS",
            "description": "Directed study projects as arranged with a faculty member."
        },
        "309": {
            "title": "INTRODUCTION TO PROBABILITY AND MATHEMATICAL STATISTICS I",
            "description": "Probability and combinatorial methods, discrete and continuous, univariate and multivariate distributions, expected values, moments, normal distribution and derived distributions, estimation."
        },
        "310": {
            "title": "INTRODUCTION TO PROBABILITY AND MATHEMATICAL STATISTICS II",
            "description": "Mathematical statistical inference aims at providing an understanding of likelihood's central role to statistical inference, using the language of mathematical statistics to analyze statistical procedures, and using the computer as a tool for understanding statistics. Specific topics include: samples and populations, estimation, hypothesis testing, and theoretical properties of statistical inference."
        },
        "319": {
            "title": "TECHNIQUES IN ORDINARY DIFFERENTIAL EQUATIONS",
            "description": "Review of linear differential equations; series solution of linear differential equations; boundary value problems; Laplace transforms; possibly numerical methods and two dimensional autonomous systems."
        },
        "320": {
            "title": "LINEAR ALGEBRA AND DIFFERENTIAL EQUATIONS",
            "description": "An introduction to linear algebra and differential equations with emphasis on the relationship between the theory of linear algebra and analytical and numerical techniques for solving differential equations. Linear algebra topics include linear systems, matrices and their algebra, vector spaces and linear transformations, eigenvalues and eigenvectors. Topics from differential equations include first order ODE, homogeneous and nonhomogeneous linear systems, and numerical methods."
        },
        "321": {
            "title": "APPLIED MATHEMATICAL ANALYSIS",
            "description": "Vector analysis: algebra and geometry of vectors, vector differential and integral calculus, theorems of Green, Gauss, and Stokes; complex analysis: analytic functions, complex integrals and residues, Taylor and Laurent series."
        },
        "322": {
            "title": "APPLIED MATHEMATICAL ANALYSIS",
            "description": "Sturm-Liouville theory; Fourier series, including mean convergence; boundary value problems for linear second order partial differential equations, including separation of variables and eigenfunction expansions."
        },
        "331": {
            "title": "INTRODUCTORY PROBABILITY",
            "description": "Topics covered include axioms of probability, random variables, the most important discrete and continuous probability distributions, expectation and variance, conditional probability and conditional expectations, Markov's and Chebyshev's inequalities, laws of large numbers, and the central limit theorem. Includes a brief introduction to techniques of multivariate integration."
        },
        "340": {
            "title": "ELEMENTARY MATRIX AND LINEAR ALGEBRA",
            "description": "An introduction to linear algebra. Topics include matrix algebra, linear systems of equations, vector spaces, sub-spaces, linear dependence, span, basis, rank of matrices, determinants, linear transformations, coordinate representations, kernel, range, eigenvalues and eigenvectors, diagonalization, inner products and orthogonal vectors, symmetric matrices. Covers linear algebra topics in greater depth and detail thanMATH 320. Formal techniques in mathematical argument [MATH 341] not covered."
        },
        "341": {
            "title": "LINEAR ALGEBRA",
            "description": "The theory of linear algebra with an introduction to proofs and proof writing. Topics include vector spaces, linear dependence, span, basis, linear transformations, kernel, image, inner products and inner product spaces, geometry, eigenvalues, eigenvectors, standard matrix factorizations. Other content includes basic set theory, logical operations, quantifiers, direct and indirect arguments, and induction. Differential equations [MATH 320] not covered."
        },
        "375": {
            "title": "TOPICS IN MULTI-VARIABLE CALCULUS AND LINEAR ALGEBRA",
            "description": "Vector spaces and linear transformations, differential calculus of scalar and vector fields, determinants, eigenvalues and eigenvectors, multiple integrals, line integrals, and surface integrals. Freshmen students are invited to enroll by the Department of Mathematics."
        },
        "376": {
            "title": "TOPICS IN MULTI-VARIABLE CALCULUS AND DIFFERENTIAL EQUATIONS",
            "description": "Topics in multi-variable calculus and introduction to differential equations."
        },
        "390": {
            "title": "UNDERGRADUATE RESEARCH WITH MADISON EXPERIMENTAL MATHEMATICS LAB",
            "description": "An introduction to mathematical research. Instruction in ancillary skills such as literature review, mathematical software use, technical  writing and communication, etc. Requires acceptance to the Madison Experimental Mathematics undergraduate research lab."
        },
        "407": {
            "title": "TOPICS IN MATHEMATICS STUDY ABROAD",
            "description": "Credit is awarded to students who have completed an appropriate math course abroad at the advanced level having no direct equivalence within the math department offerings. The study abroad course must be pre-approved by the math department."
        },
        "415": {
            "title": "APPLIED DYNAMICAL SYSTEMS, CHAOS AND MODELING",
            "description": "An introduction to nonlinear dynamical systems including stability, bifurcations and chaos. The course will give underlying mathematical ideas, but emphasize applications from many scientific fields."
        },
        "421": {
            "title": "THE THEORY OF SINGLE VARIABLE CALCULUS",
            "description": "Covers material in first and second semester calculus but it is intended to teach math majors to write and understand proofs in mathematics in general and in calculus in particular."
        },
        "425": {
            "title": "INTRODUCTION TO COMBINATORIAL OPTIMIZATION",
            "description": "Focuses on optimization problems over discrete structures, such as shortest paths, spanning trees, flows, matchings, and the traveling salesman problem. We will investigate structural properties of these problems, and we will study both exact methods for their solution, and approximation algorithms."
        },
        "431": {
            "title": "INTRODUCTION TO THE THEORY OF PROBABILITY",
            "description": "Topics covered include axioms of probability, random variables, the most important discrete and continuous probability distributions, expectation and variance, moment generating functions, conditional probability and conditional expectations, multivariate distributions, Markov's and Chebyshev's inequalities, laws of large numbers, and the central limit theorem."
        },
        "435": {
            "title": "INTRODUCTION TO CRYPTOGRAPHY",
            "description": "Cryptography is the art and science of transmitting digital information in a secure manner. Provides an introduction to its technical aspects."
        },
        "441": {
            "title": "INTRODUCTION TO MODERN ALGEBRA",
            "description": "The integers, emphasizing general group and ring properties. Permutation groups, symmetry groups, polynomial rings, leading to notions of abstract groups and rings. Congruences, computations, including finite fields and applications. Emphasis on concepts and concrete examples and computations."
        },
        "443": {
            "title": "APPLIED LINEAR ALGEBRA",
            "description": "Review of matrix algebra. Simultaneous linear equations, linear dependence and rank, vector space, eigenvalues and eigenvectors, diagonalization, quadratic forms, inner product spaces, norms, canonical forms. Discussion of numerical aspects and applications in the sciences."
        },
        "444": {
            "title": "GRAPHS AND NETWORKS IN DATA SCIENCE",
            "description": "Mathematical foundations of networks with an emphasis on their applications in modern data science, using tools from algorithmic graph theory and linear algebra. Topics include: basics of graph theory, network statistics, graph traversal algorithms and implementation, matrix methods, community detection, PageRank, simulation of random graph models."
        },
        "461": {
            "title": "COLLEGE GEOMETRY I",
            "description": "An introduction to Euclidean or non-Euclidean geometry."
        },
        "467": {
            "title": "INTRODUCTION TO NUMBER THEORY",
            "description": "An introduction to proof writing techniques through a study of classical topics in elementary number theory. Topics include the divisibility, basic properties of primes, congruences, Fermat's theorem."
        },
        "471": {
            "title": "MATHEMATICS FOR SECONDARY SCHOOL TEACHERS",
            "description": "Capstone for future middle and high school teachers, drawing connections between higher mathematics and school mathematics."
        },
        "473": {
            "title": "HISTORY OF MATHEMATICS",
            "description": "An historical survey of the main lines of mathematical development."
        },
        "475": {
            "title": "INTRODUCTION TO COMBINATORICS",
            "description": "Problems of enumeration, distribution, and arrangement. Inclusion-exclusion principle. Generating functions and linear recurrence relations. Combinatorial identities. Graph coloring problems. Finite designs. Systems of distinct representatives and matching problems in graphs. Potential applications in the social, biological, and physical sciences. Puzzles. Problem solving."
        },
        "490": {
            "title": "UNDERGRADUATE SEMINAR",
            "description": "Intermediate or upper level topics course in mathematics. Topics vary."
        },
        "491": {
            "title": "TOPICS IN UNDERGRADUATE MATHEMATICS",
            "description": "Intermediate or upper level topics course in mathematics. Topics vary."
        },
        "513": {
            "title": "NUMERICAL LINEAR ALGEBRA",
            "description": "Direct and iterative solution of linear and nonlinear systems and of eigenproblems. LU and symmetric LU factorization. Complexity, stability, and conditioning. Nonlinear systems. Iterative methods for linear systems. QR-factorization and least squares. Eigenproblems: local and global methods."
        },
        "514": {
            "title": "NUMERICAL ANALYSIS",
            "description": "Polynomial forms, divided differences. Polynomial interpolation. Polynomial approximation: uniform approximation and Chebyshev polynomials, least-squares approximation and orthogonal polynomials. Numerical differentiation and integration. Splines, B-splines and spline approximation. Numerical methods for solving initial and boundary value problems for ordinary differential equations."
        },
        "519": {
            "title": "ORDINARY DIFFERENTIAL EQUATIONS",
            "description": "Provides a rigorous introduction to ordinary differential equations and dynamical systems. Intended for math majors and advanced (or graduate) students in other disciplines."
        },
        "521": {
            "title": "ANALYSIS I",
            "description": "The real numbers, elements of set theory, metric spaces and basic topology, sequences and series, limits, continuity, differentiation, integration, sequences and series of functions, uniform convergence."
        },
        "522": {
            "title": "ANALYSIS II",
            "description": "Special functions, power series, Fourier series, approximation, contraction principle, characterizations of compactness in metric spaces, applications to differential equations. Differential calculus in normed spaces, including implicit and inverse function theorems. Course is essential for graduate work in mathematics."
        },
        "525": {
            "title": "LINEAR OPTIMIZATION",
            "description": "Introduces optimization problems whose constraints are expressed by linear inequalities. Develops geometric and algebraic insights into the structure of the problem, with an emphasis on formal proofs. Presents the theory behind the simplex method, the main algorithm used to solve linear optimization problems. Explores duality theory and theorems of the alternatives."
        },
        "531": {
            "title": "PROBABILITY THEORY",
            "description": "A rigorous introduction to probability theory at an advanced undergraduate level. Only a minimal amount of measure theory is used, in particular, the theory of Lebesgue integrals is not needed. It is aimed at math majors and Master's degree students, or students in other fields who will need probability in their future careers. Gives an introduction to the basics (Kolmogorov axioms, conditional probability and independence, random variables, expectation) and discusses some classical results with proofs (DeMoivre-Laplace limit theorems, the study of simple random walk on the one dimensional lattice, applications of generating functions)."
        },
        "535": {
            "title": "MATHEMATICAL METHODS IN DATA SCIENCE",
            "description": "A rigorous introduction to mathematical concepts important for modern data science.   Topics include: matrix factorizations,  optimization theory and algorithms, probabilistic models, finite Markov chains.  Mathematical techniques are motivated by and illustrated on a range of applied problems from machine learning and statistics."
        },
        "540": {
            "title": "LINEAR ALGEBRA II",
            "description": "Review of linear transformations, duality. Diagonalization of linear transformations.The Cayley Hamilton Theorem. Minimal polynomials. The Jordan canonical form. Exponential function. Inner product spaces, orthonormal bases and Gram-Schmidt orthogonalization. Operators on inner product spaces. Self-adjoint, unitary and positive operators. Spectral theorem. singular value decomposition. Bilinear and quadratic forms. Norms, bounded linear operators, matrix norms. Basic multilinear algebra. This is a second course in linear algebra."
        },
        "541": {
            "title": "MODERN ALGEBRA",
            "description": "Groups, normal subgroups, Cayley's theorem, rings, ideals, homomorphisms, polynomial rings, abstract vector spaces."
        },
        "542": {
            "title": "MODERN ALGEBRA",
            "description": "Field extensions, roots of polynomials, splitting fields, simple extensions, linear transformations, matrices, characteristic roots, canonical forms, determinants."
        },
        "551": {
            "title": "ELEMENTARY TOPOLOGY",
            "description": "Topological spaces, connectedness, compactness, separation axioms, metric spaces."
        },
        "552": {
            "title": "ELEMENTARY GEOMETRIC AND ALGEBRAIC TOPOLOGY",
            "description": "Introduction to algebraic topology. Emphasis on geometric aspects, including two-dimensional manifolds, the fundamental group, covering spaces, basic simplicial homology theory, the Euler-Poincare formula, and homotopy classes of mappings."
        },
        "561": {
            "title": "DIFFERENTIAL GEOMETRY",
            "description": "Theory of curves and surfaces by differential methods."
        },
        "567": {
            "title": "MODERN NUMBER THEORY",
            "description": "A course in number theory covering fundamentals and modern applications in topics of recent interest: Modular arithmetic, quadratic reciprocity, arithmetic functions, zeta function, Diophantine equations, transcendental numbers, Roth's theorem, continued fractions, and the circle method. Optional material from probability including random matrix theory."
        },
        "570": {
            "title": "FUNDAMENTALS OF SET THEORY",
            "description": "Introduces the basic concepts of Set Theory including: Set-theoretical paradoxes and means of avoiding them, sets, relations, functions, orders and well-orders, proof by transfinite induction and definitions by transfinite recursion, cardinal and ordinal numbers and their arithmetic, construction of the real numbers, the axiom of choice and its consequences."
        },
        "571": {
            "title": "MATHEMATICAL LOGIC",
            "description": "Basics of logic and mathematical proofs; propositional logic; first order logic; undecidability."
        },
        "605": {
            "title": "STOCHASTIC METHODS FOR BIOLOGY",
            "description": "Intended to provide a rigorous foundation for stochastic modeling of biological systems. The mathematical emphasis is in stochastic analysis and simulation. Biological applications include epidemiological phenomena, biochemical reaction networks and population dynamics."
        },
        "607": {
            "title": "TOPICS IN MATHEMATICS STUDY ABROAD",
            "description": "Credit is awarded to students who have completed an appropriate math course abroad at the advanced level having no direct equivalence within the math department offerings. The study abroad course must be pre-approved by the math department."
        },
        "609": {
            "title": "MATHEMATICAL METHODS FOR SYSTEMS BIOLOGY",
            "description": "Provides a rigorous foundation for mathematical modeling of biological systems. Mathematical techniques include dynamical systems and differential equations. Applications to biological pathways, including understanding of bistability within chemical reaction systems, are emphasized."
        },
        "616": {
            "title": "DATA-DRIVEN DYNAMICAL SYSTEMS, STOCHASTIC MODELING AND PREDICTION",
            "description": "An introduction to data-driven dynamical systems, including mathematical theory, methodology, numerical algorithms, applications and the use of a programming language to solve related coding problems. Topics include stochastic toolkits for dynamical systems and data science, linear Gaussian processes, nonlinear stochastic systems, elementary stochastic differential equations, data assimilation, parameter estimation, forecasting and prediction."
        },
        "619": {
            "title": "ANALYSIS OF PARTIAL DIFFERENTIAL EQUATIONS",
            "description": "A rigorous introduction to the theoretical underpinnings of the basic methods and techniques in the modern theory of PDEs. It is aimed at math majors, but will also be useful to some students in the sciences, engineering and economics who feel the need for a deeper understanding of the theory of PDEs. The emphasis is on the exposure to a number of different methods of solution of PDEs and their connection to physical phenomena modeled by the equations. The goals include both learning to solve some basic types of PDEs as well as to understand the motivation behind and inner workings of the techniques involved."
        },
        "621": {
            "title": "INTRODUCTION TO MANIFOLDS",
            "description": "Integration in Euclidean spaces, change of variables, multilinear algebra, vector fields and differential forms, manifolds and tangent spaces, integration on manifolds, Stokes theorem. Classical vector analysis. Cauchy integral theorem."
        },
        "623": {
            "title": "COMPLEX ANALYSIS",
            "description": "Elementary functions of a complex variable; conformal mapping; complex integrals; the calculus of residues."
        },
        "627": {
            "title": "INTRODUCTION TO FOURIER ANALYSIS",
            "description": "Fourier series and integrals, and their applications."
        },
        "629": {
            "title": "INTRODUCTION TO MEASURE AND INTEGRATION",
            "description": "Lebesgue integral and measure, abstract measure and integration, differentiation, spaces of integrable functions."
        },
        "632": {
            "title": "INTRODUCTION TO STOCHASTIC PROCESSES",
            "description": "Topics include discrete-time Markov chains, Poisson point processes, continuous-time Markov chains, and renewal processes. Applications to queueing, branching, and other models in science, engineering and business."
        },
        "635": {
            "title": "AN INTRODUCTION TO BROWNIAN MOTION AND STOCHASTIC CALCULUS",
            "description": "Presents an introduction to Brownian motion and its application to stochastic calculus. Sample path properties of Brownian motion, Ito stochastic integrals, Ito's formula, stochastic differential equations and properties of their solutions, and various applications will be included."
        },
        "641": {
            "title": "INTRODUCTION TO ERROR-CORRECTING CODES",
            "description": "Coding theory. Codes (linear, Hamming, Golay, dual); decoding-encoding; Shannon's theorem; sphere-packing; singleton and Gilbert-Varshamov bounds; weight enumerators; MacWilliams identities; finite fields; other codes (Reed-Muller, cyclic, BCH, Reed-Solomon) and error-correction algorithms."
        },
        "681": {
            "title": "SENIOR HONORS THESIS",
            "description": "Individual study for honors math majors writing a thesis in mathematics."
        },
        "682": {
            "title": "SENIOR HONORS THESIS",
            "description": "Individual study for honors math majors writing a thesis in mathematics."
        },
        "691": {
            "title": "UNDERGRADUATE THESIS",
            "description": "Individual study for students writing a thesis in mathematics."
        },
        "692": {
            "title": "UNDERGRADUATE THESIS",
            "description": "Individual study for students writing a thesis in mathematics."
        },
        "698": {
            "title": "DIRECTED STUDY",
            "description": "Directed study projects as arranged with a faculty member."
        },
        "699": {
            "title": "DIRECTED STUDY",
            "description": "Directed study projects as arranged with a faculty member."
        },
        "703": {
            "title": "METHODS OF APPLIED MATHEMATICS 1",
            "description": "Study of the linear algebraic structure underlying discrete equilibrium problems. Boundary value problems for continous equilibria: Sturm-Liouville equations, Laplace's equation, Poisson's equation, and the equations for Stokes flow. Contour integration and conformal mapping. Applications of dynamics leading to initial value problems for ODEs and PDEs. Green's functions for ODEs and introduction to asymptotic methods for ODEs, e.g. WKB analysis. Separation of variables and eigenfunction expansions for linear PDEs. Examples from physics and engineering throughout. Knowledge of undergraduate linear algebra, analysis and complex analysis is strongly recommended."
        },
        "704": {
            "title": "METHODS OF APPLIED MATHEMATICS-2",
            "description": "Derivation, nature and solution of canonical partial differential equations of applied mathematics. Conservation laws, advection, diffusion. First order PDEs, characteristics, shocks. Traffic flow, eikonal and Hamilton-Jacobi equations. Higher order PDEs: classification, Fourier analysis, well-posedness. Series solutions and integral transforms. Green's functions and distributions. Similarity solutions. Asymptotics of Fourier integrals. Laplace's method, stationary phase. Ship waves. Perturbation methods. Knowledge of undergraduate linear algebra, analysis and complex analysis is strongly recommended."
        },
        "705": {
            "title": "MATHEMATICAL FLUID DYNAMICS",
            "description": "Advanced introduction to fluid dynamics. Basic concepts; elementary viscous flow; Navier-Stokes equations. Elementary airfoil theory; boundary layers. Vortex motion. Waves. Very viscous flow. Compressible flows. Instabilities, bifurcations, turbulence. Requires working knowledge of multivariate calculus, differential equations and mechanics."
        },
        "709": {
            "title": "MATHEMATICAL STATISTICS",
            "description": "Introduction to measure theoretic probability; derivation and transformation of probability distributions; generating functions and characteristic functions; conditional expectation, sufficiency, and unbiased estimation; methods of large sample theory including laws of large numbers and central limit theorems; order statistics."
        },
        "710": {
            "title": "MATHEMATICAL STATISTICS",
            "description": "Estimation, efficiency, Neyman-Pearson theory of hypothesis testing, confidence regions, decision theory, analysis of variance, and distribution of quadratic forms."
        },
        "714": {
            "title": "METHODS OF COMPUTATIONAL MATHEMATICS I",
            "description": "Development of finite difference methods for hyperbolic, parabolic and elliptic partial differential equations. Analysis of accuracy and stability of difference schemes. Direct and iterative methods for solving linear systems. Introduction to finite volume methods. Applications from science and engineering. Students are strongly encouraged to have programming skills (e.g.COMP SCI 200) and some undergraduate numerical analysis (e.g.MATH/​COMP SCI  514orCOMP SCI 412), analysis and differential equations (e.g.MATH 322andMATH 521) and linear algebra (e.g.MATH 341)."
        },
        "715": {
            "title": "METHODS OF COMPUTATIONAL MATHEMATICS II",
            "description": "Introduction to spectral methods (Fourier, Chebyshev, Fast Fourier Transform), finite element methods (Galerkin methods, energy estimates and error analysis), and mesh-free methods (Monte-Carlo, smoothed-particle hydrodynamics) for solving partial differential equations. Applications from science and engineering. Applications from science and engineering. Students are strongly encouraged to have programming skills (e.g.COMP SCI 200), undergraduate numerical analysis (e.g.MATH/​COMP SCI  514orCOMP SCI 412), analysis (MATH 322and521) and linear algebra (e.g.MATH 341or equiv.)"
        },
        "716": {
            "title": "ORDINARY DIFFERENTIAL EQUATIONS",
            "description": "Existence, uniqueness, and continuous dependence theorems, linear systems, stability, singular points, and boundary value problems. Qualitative behavior of nonlinear equations, stability, Lyapunov functions, invariant manifolds, bifurcation theory, periodic orbits, and connecting orbits."
        },
        "717": {
            "title": "STOCHASTIC COMPUTATIONAL METHODS",
            "description": "Introduction to computational methods that use stochastic algorithms and/or methods that are applied to random or stochastic mathematical problems. The main emphasis will be placed on learning practical tools, while some aspects of theoretical foundations will also be covered (e.g., basic error analysis for numerical solution of stochastic differential equations (SDEs), and basic convergence of Monte Carlo methods). Topics include Monte Carlo methods, Bayesian inference and Bayesian sampling, simulation of Markov chains, numerical analysis for SDEs, data assimilation / state estimation, stochastic optimization methods and random sketching. Applications to science, engineering, finance, data science, and other practical problems also included."
        },
        "718": {
            "title": "RANDOMIZED LINEAR ALGEBRA AND APPLICATIONS",
            "description": "Random solvers have been playing increasingly crucial roles in the modern computational tasks. The recent breakthroughs in applied and computational linear algebra that incorporate techniques of randomization have proven to be of great importance in modern applied math, computational sciences and data science, such as inverse problems, machine learning and scientific computing. The guiding principle is that one may greatly reduce computational and storage expenses at the cost of a small probability of failure. Systematic study of these modern methods of randomized linear algebra solvers will be provided, presenting mathematical backgrounds, algorithms, and concrete applications. Core theoretical topics include randomized Kaczmarz and its generalization to stochastic gradient descent, randomized singular value decomposition, random sketching, matrix completion, and compressive sensing, and corresponding applications."
        },
        "719": {
            "title": "PARTIAL DIFFERENTIAL EQUATIONS",
            "description": "Classical theory of partial differential equations, together with an introduction to the modern theory based on functional analysis. Familiarity with basic measure theory (e.g.MATH 629or721) or concurrent registration inMATH 721is strongly recommended."
        },
        "720": {
            "title": "PARTIAL DIFFERENTIAL EQUATIONS",
            "description": "Linear elliptic, parabolic and hyperbolic equations, continuing with calculus of variations and then nonlinear initial value problems."
        },
        "721": {
            "title": "A FIRST COURSE IN REAL ANALYSIS",
            "description": "Real analysis concentrating on measures, integration, and differentiation and including an introduction to Hilbert spaces. Knowledge of undergraduate analysis (e.g. the sequenceMATH 521and522) is strongly recommended."
        },
        "722": {
            "title": "COMPLEX ANALYSIS",
            "description": "The basic theory of functions of one complex variable including Cauchy formula, singularities and residues, meromorphic functions, conformal mappings, harmonic functions, approximation and the nonhomogeneous d-bar equation. Requires knowledge of undergraduate analysis (e.g. the sequenceMATH 521and522)."
        },
        "725": {
            "title": "A SECOND COURSE IN REAL ANALYSIS",
            "description": "Continuation ofMATH 721. An introduction to further topics in real analysis: Banach spaces, Fourier transforms, elements of distribution theory, and applications."
        },
        "726": {
            "title": "NONLINEAR OPTIMIZATION I",
            "description": "Theory and algorithms for nonlinear optimization, focusing on unconstrained optimization. Line-search and trust-region methods; quasi-Newton methods; conjugate-gradient and limited-memory methods for large-scale problems; derivative-free optimization; algorithms for least-squares problems and nonlinear equations; gradient projection algorithms for bound-constrained problems; and simple penalty methods for nonlinearly constrained optimization. Students are strongly encouraged to have knowledge of linear algebra and familiarity with basic mathematical analysis."
        },
        "728": {
            "title": "INTEGER OPTIMIZATION",
            "description": "Introduces optimization problems over integers, and surveys the theory behind the algorithms used in state-of-the-art methods for solving such problems. Special attention is given to the polyhedral formulations of these problems, and to their algebraic and geometric properties. Applicability of Integer Optimization is highlighted with applications in combinatorial optimization. Key topics include: formulations, relaxations, polyhedral theory, cutting planes, decomposition, enumeration.  Students are strongly encouraged to have knowledge of Linear Programming  (e.g.,MATH/​COMP SCI/​I SY E/​STAT  525), including algorithms, duality and polyhedral theory."
        },
        "730": {
            "title": "NONLINEAR OPTIMIZATION II",
            "description": "Theory and algorithms for nonlinearly constrained optimization. Relevant geometric concepts, including tangent and normal cones, theorems of the alternative, and separation results. Constraint qualifications. Geometric and algebraic expression of first-order optimality conditions. Second-order optimality conditions. Duality. Nonlinear  programming algorithms: merit functions and filters; interior-point, augmented Lagrangian, and sequential quadratic programming algorithms."
        },
        "733": {
            "title": "THEORY OF PROBABILITY I",
            "description": "An introduction to measure theoretic probability and stochastic processes.Topics include foundations, independence, zero-one laws, laws of large numbers, convergence in distribution, characteristic functions, central limit theorems, random walks, conditional expectations. Familiarity with basic measure theory (e.g.MATH 629or721) or concurrent registration inMATH 721is strongly recommended."
        },
        "734": {
            "title": "THEORY OF PROBABILITY II",
            "description": "Possible topics include martingales, weak convergence of measures, introduction to Brownian motion."
        },
        "735": {
            "title": "STOCHASTIC ANALYSIS",
            "description": "Foundations of continuous time stochastic processes, semimartingales and the semimartingale integral, Ito's formula, stochastic differential equations, stochastic equations for Markov processes, application in finance, filtering, and control. The course relies on measure theoretic probability theory that can be reviewed at the beginning of the semester."
        },
        "740": {
            "title": "ENUMERATIVE COMBINATORICS/SYMMETRIC FUNCTIONS",
            "description": "Inclusion-exclusion principle, permutation statistics, sieve methods, unimodal sequences, posets, lattice theory, Mobius functions, generating functions, bases and transition matrices for symmetric functions, Young tableaux, plane partitions, polytopes, poset homology, Stanley-Reisner rings."
        },
        "741": {
            "title": "ABSTRACT ALGEBRA",
            "description": "Usually a study of finite groups and noncommutative rings. Group theoretic topics may include: permutation groups, Lagrange's theorem, Cauchy's theorem and the Sylow theorems, solvable and nilpotent groups. Ring theoretic topics may include: Artinian rings and modules, the Wedderburn theorems, the Hopkins-Levitzki theorem, the Jacobson radical and density theorem. The basic prerequisite for all advanced graduate courses in algebra.  Familiarity with topics in undergraduate algebra (e.g.MATH 541and542) is strongly recommended."
        },
        "742": {
            "title": "ABSTRACT ALGEBRA",
            "description": "Continuation ofMATH 741. Usually the study of commutative rings and fields. Ring theoretic topics may include: modules over PIDs, Noetherian rings and the Hilbert basis theorem, the Lasker-Noether theorem, the Krull intersection theorem, integrality and the Hilbert Nullstellensatz. Field theoretic topics may include: algebraic extensions, Galois theory, solvability of polynomials and classical constructability problems."
        },
        "746": {
            "title": "TOPICS IN RING THEORY",
            "description": "Will alternate between commutative and noncommutative ring theory. Commutative topics include localization; local rings; dimension theory; Cohen-Macaulay rings. Noncommutative topics include projective modules; injective modules; flat modules; homological and global dimension; Wedderburn and Goldie rings. Basic graduate algebra courses (e.g.MATH 741and742) are strongly recommended."
        },
        "747": {
            "title": "LIE ALGEBRAS",
            "description": "Lie algebras and matrix groups. Topics: tangent spaces; exponentials; Baker-Campbell-Hausdorff formula; (nilpotent, solvable, semisimple) Lie algebras; Engel's and Lie's theorems; Levi decomposition; Killing form; sl(2)-representations; root systems; Dynkin diagrams; Weyl groups; Cartan and Borel subalgebras; Serre's theorem. Basic graduate algebra courses (e.g.MATH 541and542orMATH 741and742) are strongly recommended."
        },
        "748": {
            "title": "ALGEBRAIC NUMBER THEORY",
            "description": "A rigorous introduction to the arithmetic of number fields; algebraic integers, geometry of numbers, Dirichlet's Unit Theorem, ideal class groups, first case of Fermat's Last Theorem; prime decompositions, Galois automorphisms. Basic graduate algebra courses (e.g.MATH 741and742) are strongly recommended."
        },
        "749": {
            "title": "ANALYTIC NUMBER THEORY",
            "description": "An introduction to the Riemann zeta function and Dirichlet L-functions, and their application to topics such as the distribution of prime numbers and the arithmetic of quadratic fields. Familiarity with elementary number theory [such asMATH 567] and complex analysis [such asMATH 623] is strongly recommended."
        },
        "750": {
            "title": "HOMOLOGICAL ALGEBRA",
            "description": "Topics include: complexes, cohomology, double complexes, spectral sequences; abelian categories, derived categories, derived functors; Tor and Ext, Koszul complexes; group cohomology; sheaf cohomology, hypercohomology. Basic graduate algebra courses (e.g.MATH 741and742) are strongly recommended"
        },
        "751": {
            "title": "INTRODUCTORY TOPOLOGY I",
            "description": "An introduction to algebraic and differential topology. Elements of homotopy theory, fundamental group, covering spaces. Differentiable manifolds, tangent vectors, regular values, transversality, examples of compact Lie groups. Homological algebra, chain complexes, cell complexes, singular and cellular homology, calculations for surfaces, spheres, projective spaces, etc. Familiarity with undergraduate algebra and topologyMATH 541or551) is strongly recommended."
        },
        "752": {
            "title": "INTRODUCTORY TOPOLOGY II",
            "description": "Continuation ofMATH 751. Cohomology, Universal Coefficient Theorem, Kunneth Formula, cup and cap products, applications to manifolds, orientability, Poincare Duality. Differential forms, integration and Stokes Theorem, De Rham Theorem. Calculations, further duality theorems, Euler class, Lefschetz Fixed-Point Theorem."
        },
        "753": {
            "title": "ALGEBRAIC TOPOLOGY I",
            "description": "Higher homotopy groups, elements of obstruction theory, fibrations, bundle theory, classifying spaces, applications to smooth mainfolds, differential forms, vector bundles, characteristic classes, cobordism, applications and calculations. Basic graduate topology courses (e.g.MATH 751and752) are strongly recommended."
        },
        "754": {
            "title": "ALGEBRAIC TOPOLOGY II",
            "description": "Continuation ofMATH 753. Topics include: spectral sequences and their applications, topology of Lie Groups, H-spaces, Hopf Algebras, homotopy classification of bundles, the Steenrod Algebra and its applications, intorduction to generalized cohomology theories, spectra, elements of K-theory."
        },
        "758": {
            "title": "INTRODUCTION TO ERGODIC THEORY AND DYNAMICS",
            "description": "An introduction to ergodic theory and dynamics covering fundamental theorems of ergodic theory, classical examples of one and two dimensional dynamics as well as applications to study of group actions."
        },
        "761": {
            "title": "DIFFERENTIABLE MANIFOLDS",
            "description": "Differentiable manifolds, vector bundles, implicit function theorem, submersions and immersions, vector fields and flows, foliations and Frobenius theorem, differential forms and exterior calculus, integration and Stokes' theorem, De Rham theory, Riemannian metrics. Familiarity with basic undergraduate analysis coursesMATH 521and522orMATH 621) is strongly recommended."
        },
        "763": {
            "title": "INTRODUCTION TO ALGEBRAIC GEOMETRY",
            "description": "Algebraic preliminaries, including local rings; valuation theory, and power series rings; geometry of algebraic varieties with emphasis on curves and surfaces."
        },
        "764": {
            "title": "INTRODUCTION TO ALGEBRAIC GEOMETRY",
            "description": "Continuation ofMATH 763."
        },
        "765": {
            "title": "DIFFERENTIAL GEOMETRY",
            "description": "Covers the metric properties of Riemannian manifolds. The following topics will be covered: Vector bundles and connections, Riemannian metrics, submanifolds and second fundamental form, first variation of arc length, geodesics, Hopf-Rinow theorem, second variation of arc length, Jacobi fields and index lemmas, Bonnet-Meyer theorem, Rauch comparison theorem, spaces of constant curvature, Hodge-de Rham theory. Familiarity with the topics in a differential manifolds course (e.g.MATH 761) is strongly recommended."
        },
        "770": {
            "title": "FOUNDATIONS OF MATHEMATICS",
            "description": "First-order logic syntax and semantics, Completeness and Compactness Theorems, Lowenheim-Skolem Theorem, computable and computably enumerable sets, Incompleteness Theorem, axioms of Zermelo-Fraenkel set theory with choice, ordinal and cardinal arithmetic."
        },
        "771": {
            "title": "SET THEORY",
            "description": "Martin's Axiom, Suslin and Aronszajn trees, diamond principle, absoluteness and reflection, constructible universe, and one-step forcing constructions. Familiarity with the topics in a basic Foundations course such asMATH 770is strongly recommended."
        },
        "773": {
            "title": "COMPUTABILITY THEORY",
            "description": "Turing degree and jump, strong reducibilities, arithmetic hierarchy, index sets, simple and (hyper)hypersimple sets, easy forcing arguments in computability theory, finite and infinite injury, Friedberg-Muchnik and Sacks Splitting Theorem, Sacks Jump and Sacks Density Theorems, computable ordinals. Familiarity with the topics in a basic Foundations course such asMATH 770is strongly recommended."
        },
        "776": {
            "title": "MODEL THEORY",
            "description": "Review of compactness and some consequences. Quantifier elimination with examples. The omitting types theorem. Categoricity. Baldwin-Lachlan theory. Strongly minimal and o-minimal theories. Saturated models. Morley's theorem. Familiarity with the topics in a basic Foundations course such asMATH 770is strongly recommended."
        },
        "777": {
            "title": "NONLINEAR DYNAMICS, BIFURCATIONS AND CHAOS",
            "description": "Advanced interdisciplinary introduction to qualitative and geometric methods for dissipative nonlinear dynamical systems. Local bifurcations of ordinary differential equations and maps. Chaotic attractors, horseshoes and detection of chaos."
        },
        "790": {
            "title": "MASTERS THESIS",
            "description": "Work on a Master's thesis under the supervision of a faculty member."
        },
        "801": {
            "title": "TOPICS IN APPLIED MATHEMATICS",
            "description": "Selected topics in applied mathematics, applied analysis or numerical analysis and scientific computing."
        },
        "803": {
            "title": "EXPERIMENTAL DESIGN I",
            "description": "Summary of matrix algebra required, theory of estimable functions, incomplete blocks, balanced incomplete block designs, partially balanced incomplete block designs."
        },
        "807": {
            "title": "DYNAMICAL SYSTEMS",
            "description": "Treats the qualitative behavior of continuous and discrete dynamical systems, including Hamiltonian systems of differential equations. Typical topics include periodic and almost periodic solutions, the fixed point theorem of Poincare and Birkhoff, invariant curves and KAM theory, celestial mechanics, and chaotic behavior."
        },
        "821": {
            "title": "ADVANCED TOPICS IN REAL ANALYSIS",
            "description": "Topics in partial differential equations and real analysis."
        },
        "823": {
            "title": "ADVANCED TOPICS IN COMPLEX ANALYSIS",
            "description": "Several complex variables. Basic several complex variables or more special topics."
        },
        "825": {
            "title": "SELECTED TOPICS IN FUNCTIONAL ANALYSIS",
            "description": "Topics will vary and may include spectral theory, nonlinear functional analysis or abstract harmonic analysis."
        },
        "826": {
            "title": "ADVANCED TOPICS IN FUNCTIONAL ANALYSIS AND DIFFERENTIAL EQUATIONS",
            "description": "Topics in functional analysis and differential equations."
        },
        "827": {
            "title": "FOURIER ANALYSIS",
            "description": "Introduction to Fourier analysis in Euclidean spaces and related topics that may include singular and oscillatory integrals and trigonometric series."
        },
        "828": {
            "title": "ADVANCED TOPICS IN HARMONIC ANALYSIS",
            "description": "Continuation ofMATH 827. Advanced topics in harmonic analysis."
        },
        "833": {
            "title": "TOPICS IN THE THEORY OF PROBABILITY",
            "description": "Advanced topics in probability and stochastic processes."
        },
        "842": {
            "title": "TOPICS IN APPLIED ALGEBRA",
            "description": "Applied topics with emhasis on algebraic constructions and structures. Examples include: algebraic coding theory; codes (algebraic-geometric, convolutional, low-density-parity-check, space-time); curve and lattice based cryptography; watermarking; computer vision (face recognition, multiview geometry)."
        },
        "843": {
            "title": "REPRESENTATION THEORY",
            "description": "Introduction to the representation theory of Lie groups and their combinatorics. Universal enveloping algebras, highest weight modules, induction, restriction, weights, characters, multiplicity formulas, tensor products, Shapovalov forms, filtrations,  Kazhdan-Zetlin patterns, Littelmann paths."
        },
        "844": {
            "title": "ARITHMETIC GEOMETRY",
            "description": "An introduction to arithmetic geometry with emphasis on arithmetic of elliptic curves."
        },
        "845": {
            "title": "CLASS FIELD THEORY",
            "description": "Introduction to local and global class field theory. Theory of local fields; local and global class field theory; complex multiplication, adeles, ideles, idele class characters, Tchebotarev's Density Theorem, CM elliptic curves, construction of class fields of imaginary quadratic fields."
        },
        "846": {
            "title": "TOPICS IN COMBINATORICS",
            "description": "Topics in algebraic combinatorics such as (but not limited to) association schemes, hypergeometric series, classical orthogonal polynomials, codes,  lattices, invariant theory, alternating sign matrices and domino tilings, statistical mechanical models, 6j-symbols, buildings and diagram geometries, matroids."
        },
        "847": {
            "title": "TOPICS IN ALGEBRA",
            "description": "Topics may include: Lie groups, algebraic groups, Chevalley groups, simple groups and associated geometries, group cohomology, group rings, Hopf algebras, enveloping algebras, quantum groups, infinite-dimensional Lie algebras, Hecke algebras, automorphic forms, Galois representations, zeta and L-functions, abelian varieties."
        },
        "848": {
            "title": "ADVANCED TOPICS IN NUMBER THEORY",
            "description": "This is an advanced graduate topic course in number theory. Topics will vary. Target audience: Advanced graduate students in number theory, representation theory, and algebraic geometry."
        },
        "849": {
            "title": "AUTOMORPHIC FORMS",
            "description": "Classical and/or modern theory of automorphic forms. Representation theory of GL(2)."
        },
        "851": {
            "title": "TOPICS IN GEOMETRIC TOPOLOGY",
            "description": "Advanced Topics in Geometric Topology."
        },
        "853": {
            "title": "TOPICS IN ALGEBRAIC TOPOLOGY",
            "description": "Topics in Algebraic Topology."
        },
        "856": {
            "title": "TOPICS IN DIFFERENTIAL TOPOLOGY",
            "description": "The theory of differential manifolds such as differential forms and de Rham theorem, cobordism groups, Lie groups, homogeneous spaces, fiber bundles, characteristic classes."
        },
        "863": {
            "title": "ADVANCED TOPICS IN ALGEBRAIC GEOMETRY",
            "description": "Geometry of several complex variables; algebraic groups, abelian varieties; topological aspects of algebraic geometry, including sheaf theory and homology theory; advanced theory of local rings; intersection theory of algebraic varieties."
        },
        "865": {
            "title": "ADVANCED TOPICS IN GEOMETRY",
            "description": "Selected from advanced projective geometry, non-Euclidean geometry, Riemannian geometry, distance geometry and the geometry of convex surfaces, geometry of numbers."
        },
        "867": {
            "title": "ANALYTIC NUMBER THEORY",
            "description": "Prime number theory, prime number theory for arithmetic progressions, additive number theory, density theorems."
        },
        "873": {
            "title": "ADVANCED TOPICS IN FOUNDATIONS",
            "description": "Advanced topics from all areas of mathematical logic."
        },
        "888": {
            "title": "TOPICS IN MATHEMATICAL DATA SCIENCE",
            "description": "Advanced topics in the mathematical foundations of data science"
        },
        "900": {
            "title": "GRADUATE TEACHING SEMINAR",
            "description": "Focuses on theory and practical skills relevant to teaching mathematics at the graduate or post-secondary level."
        },
        "921": {
            "title": "SEMINAR IN ANALYSIS",
            "description": "Selected topics in Analysis."
        },
        "941": {
            "title": "SEMINAR-ALGEBRA",
            "description": "Selected topics in Algebra."
        },
        "951": {
            "title": "SEMINAR IN TOPOLOGY",
            "description": "Selected topics in Topology."
        },
        "967": {
            "title": "SEMINAR IN NUMBER THEORY",
            "description": "Selected topics in Number Theory."
        },
        "975": {
            "title": "SEMINAR-THE FOUNDATIONS OF MATHEMATICS",
            "description": "Selected topics in Mathematical Logic."
        },
        "990": {
            "title": "READING AND RESEARCH",
            "description": "Reading and research in all areas of Mathematics."
        }
    },
    "STAT": {
        "240": {
            "title": "DATA SCIENCE MODELING I",
            "description": "Introduces reproducible data management, modeling, analysis, and statistical inference through a practical, hands-on case studies approach. Topics include the use of an integrated statistical computing environment, data wrangling, the R programming language, data graphics and visualization, random variables and concepts of probability including the binomial and normal distributions, data modeling, statistical inference in one- and two- sample settings for proportions and means, simple linear regression, and report generation using R Markdown with applications to a wide variety of data to address open-ended questions."
        },
        "301": {
            "title": "INTRODUCTION TO STATISTICAL METHODS",
            "description": "Distributions, measures of central tendency, dispersion and shape, the normal distribution; experiments to compare means, standard errors, confidence intervals; effects of departure from assumption; method of least squares, regression, correlation, assumptions and limitations; basic ideas of experimental design."
        },
        "303": {
            "title": "R FOR STATISTICS I",
            "description": "An understanding of the commonly used statistical language R. Topics will include using R to manipulate data and perform exploratory data analysis."
        },
        "304": {
            "title": "R FOR STATISTICS II",
            "description": "Provides an understanding of the commonly used statistical language R. Topics will include writing conditional expressions, loops, and functions; manipulating data matrices and arrays; extracting data from text; and making high level visualizations of data."
        },
        "305": {
            "title": "R FOR STATISTICS III",
            "description": "Provides an understanding of the commonly used statistical language R. Learn to combine R with high performance computing tools to do scientific computing."
        },
        "309": {
            "title": "INTRODUCTION TO PROBABILITY AND MATHEMATICAL STATISTICS I",
            "description": "Probability and combinatorial methods, discrete and continuous, univariate and multivariate distributions, expected values, moments, normal distribution and derived distributions, estimation."
        },
        "310": {
            "title": "INTRODUCTION TO PROBABILITY AND MATHEMATICAL STATISTICS II",
            "description": "Mathematical statistical inference aims at providing an understanding of likelihood's central role to statistical inference, using the language of mathematical statistics to analyze statistical procedures, and using the computer as a tool for understanding statistics. Specific topics include: samples and populations, estimation, hypothesis testing, and theoretical properties of statistical inference."
        },
        "311": {
            "title": "INTRODUCTION TO THEORY AND METHODS OF MATHEMATICAL STATISTICS I",
            "description": "Elements of probability, important discrete distributions, acceptance sampling by attributes, sample characteristics, probability distributions and population characteristics, the normal distribution, acceptance sampling plans based on sample means and variances, sampling from the normal, the central limit theorem, point and interval estimation."
        },
        "312": {
            "title": "INTRODUCTION TO THEORY AND METHODS OF MATHEMATICAL STATISTICS II",
            "description": "Unbiased estimation, maximum likelihood estimation, confidence intervals, tests of hypotheses, Neyman-Pearson lemma, likelihood ratio test, regression, analysis of variance with applications."
        },
        "324": {
            "title": "INTRODUCTORY APPLIED STATISTICS FOR ENGINEERS",
            "description": "Descriptive statistics, probability concepts and distributions, random variables. Hypothesis tests and confidence intervals for one- and two-sample problems. Linear regression, model checking, and inference. Analysis of variance and basic ideas in experimental design. Utilizes the R programming language."
        },
        "333": {
            "title": "APPLIED REGRESSION ANALYSIS",
            "description": "An introduction to regression with emphasis on the practical aspects. Topics include: straight-line model, role of assumptions, residual analysis, transformations, multiple regression (with some use of matrix notation), multicollinearity, subset selection, and a brief introduction to mixed models."
        },
        "340": {
            "title": "DATA SCIENCE MODELING II",
            "description": "Teaches how to explore, model, and analyze data using R. Topics include basic probability models; the central limit theorem; Monte Carlo simulation; one- and two-sample hypothesis testing; Bayesian inference; linear and logistic regression; ANOVA; the bootstrap; random forests and cross-validation. Features the analysis of real-world data sets and the communication of findings in a clear and reproducible manner within a project setting."
        },
        "349": {
            "title": "INTRODUCTION TO TIME SERIES",
            "description": "Autocorrelation; stationarity and non-stationarity; heteroscedasticity; dynamic models; auto-regressive and moving average models; identification and fitting; forecasting; seasonal adjustment; applications for financial time series, social sciences and environmental studies."
        },
        "351": {
            "title": "INTRODUCTORY NONPARAMETRIC STATISTICS",
            "description": "Distribution free statistical procedures or methods valid under nonrestrictive assumptions: basic tools; counting methods; order statistics, ranks, empirical distribution functions; distribution free tests and associated interval and point estimators; sign test; signed rank tests; rank tests; Mann Whitney Wilcoxon procedures; Kolmogorov Smirnov tests; permutation methods; kernel density estimation; kernel and spline regression estimation; computer techniques and programs; discussion and comparison with parametric methods."
        },
        "360": {
            "title": "TOPICS IN STATISTICS STUDY ABROAD",
            "description": "Credit is awarded for students having completed an advanced statistics course in a study abroad program for which there is no direct equivalence to the statistics department course offerings. The study abroad course must be pre-approved by the statistics department. Enrollment in a UW-Madison resident study abroad program."
        },
        "371": {
            "title": "INTRODUCTORY APPLIED STATISTICS FOR THE LIFE SCIENCES",
            "description": "Introduction to modern statistical practice in the life sciences, using the R programming language. Topics include: exploratory data analysis, probability and random variables; one-sample testing and confidence intervals, role of assumptions, sample size determination, two-sample inference; basic ideas in experimental design, analysis of variance, linear regression, goodness-of fit; biological applications."
        },
        "403": {
            "title": "INTERNSHIP COURSE IN COMP SCI AND DATA SCIENCE",
            "description": "Enables students with outside internships to earn academic credit connected to their work experience related to the Computer Sciences or Data Science programs."
        },
        "405": {
            "title": "DATA SCIENCE COMPUTING PROJECT",
            "description": "The development of tools necessary for collecting, managing, and analyzing large data sets. Examples of techniques and programs used include Linux, R, distributed computing, text editor(s), git/github, and other related tools. Work in teams to research, develop, write, and make presentations related to a variety of data analysis projects."
        },
        "411": {
            "title": "AN INTRODUCTION TO SAMPLE SURVEY THEORY AND METHODS",
            "description": "An introduction to the methods used to design sample surveys and analyze the results. Topics covered include: basic tools, simple random sampling, ratio and regression estimation, stratification, systematic sampling, cluster (area) sampling, two-stage sampling, unequal probability sampling, non-sampling errors, and missing data. For illustration and clarification, examples are drawn from diverse areas of application."
        },
        "421": {
            "title": "APPLIED CATEGORICAL DATA ANALYSIS",
            "description": "Analysis of multidimensional contingency tables, Poisson regression, and logistic regression, with emphasis on practical applications. Use of computer programs for such analyses. Model selection, testing goodness of fit, estimation of parameters, measures of association and methods for detecting sources of significance."
        },
        "424": {
            "title": "STATISTICAL EXPERIMENTAL DESIGN",
            "description": "Introduction to statistical design and analysis of experiments. Topics include: principles of randomization, blocking and replication, randomized blocking designs, Latin square designs, full factorial and fractional factorial designs and response surface methodology. Substantial focus will be devoted to engineering applications."
        },
        "431": {
            "title": "INTRODUCTION TO THE THEORY OF PROBABILITY",
            "description": "Topics covered include axioms of probability, random variables, the most important discrete and continuous probability distributions, expectation and variance, moment generating functions, conditional probability and conditional expectations, multivariate distributions, Markov's and Chebyshev's inequalities, laws of large numbers, and the central limit theorem."
        },
        "433": {
            "title": "DATA SCIENCE WITH R",
            "description": "Perform Data Science as an iterative (back and forth) process of four different types of activities (data collection, data wrangling, data analysis, communication). Traverse through the five requisite stances (scientist, coder, mathematician, methodologist, skeptic). Develop and hone a broad set of computational tools in R (but not the broadest) and a broad set of statistical/machine learning tools (but not the broadest). Focus on doing these with agility to make the coding \"transparent\" and serve the large goals of the project."
        },
        "436": {
            "title": "STATISTICAL DATA VISUALIZATION",
            "description": "Techniques for visualization within data science workflows. Topics include data preparation; exploratory data analysis; spatial, tabular, and graph structured data; dimensionality reduction; model visualization and interpretability; interactive queries and navigation."
        },
        "443": {
            "title": "CLASSIFICATION AND REGRESSION TREES",
            "description": "Introduction to algorithms and applications of classification and regression trees. Recursive partitioning, pruning, and cross-validation estimation of prediction error. Class priors and misclassification costs. Univariate and linear splits. Linear and kernel discriminant analysis and nearest-neighbor classification. Unbiased variable selection and importance scoring of variables. Least-squares, quantile, Poisson, logistic, and proportional hazards regression tree models. Tree ensembles. Subgroup identification of differential treatment effects. Multiple and longitudinal response variables. Missing values and multiple missing value codes.  Comparisons with neural networks, support vector machines, and other methods. Bootstrap calibration and post-selection inference. Applications to business, social science, engineering, biology, medicine, and other fields."
        },
        "451": {
            "title": "INTRODUCTION TO MACHINE LEARNING AND STATISTICAL PATTERN CLASSIFICATION",
            "description": "Pattern classification, regression analysis, clustering, and dimensionality reduction. For each category, covers fundamental algorithms and selections of contemporary, current state-of-the-art algorithms. Focus on evaluation of machine learning models using statistical methods. Statistical pattern classification approaches, including maximum likelihood estimation and Bayesian decision theory, algorithmic and nonparametric approaches. Practical use of machine learning algorithms using open source libraries from the Python programming ecosystem."
        },
        "453": {
            "title": "INTRODUCTION TO DEEP LEARNING AND GENERATIVE MODELS",
            "description": "Deep learning is a field that specializes in discovering and extracting intricate structures in large, unstructured datasets for parameterizing artificial neural networks with many layers. Since deep learning has pushed the state-of-the-art in many research and application areas, it's become indispensable for modern technology. Focuses on a understanding deep, artificial neural networks by connecting it to related concepts in statistics. Beyond covering deep learning models for predictive modeling, focus on deep generative models. Besides explanations on a mathematical and conceptual level, emphasize the practical aspects of deep learning. Open-source computing provides hands-on experience for implementing deep neural nets, working on supervised learning tasks, and applying generative models for dataset synthesis."
        },
        "456": {
            "title": "APPLIED MULTIVARIATE ANALYSIS",
            "description": "Theory and applications of multivariate statistical methods. Basic concepts and statistical reasoning which underlie the techniques of multivariate analysis. Ideas rather than derivations stressed although basic models discussed to give the student some feeling for their adequacy in particular situations. Acquaintance with and use of existing computer programs in the multivariate analysis area."
        },
        "461": {
            "title": "FINANCIAL STATISTICS",
            "description": "Stochastic models and statistical methodologies are widely employed in modern finance. The models and their inferences are very important for academic research and financial practices. Financial stochastic models and their statistical inferences with applications to volatility analysis and risk management, introduction to discrete models such as binomial trees and GARCH and stochastic volatility models as well as simple continuous models like the Black-Scholes model. The focus will be on statistical inference, data analysis and risk management regarding these models."
        },
        "471": {
            "title": "INTRODUCTION TO COMPUTATIONAL STATISTICS",
            "description": "Classical statistical procedures arise where closed-form mathematical expressions are available for various inference summaries (e.g. linear regression; analysis of variance). A major emphasis of modern statistics is the development of inference principles in cases where both more complex data structures are involved and where more elaborate computations are required. Topics from numerical linear algebra, optimization, Monte Carlo (including Markov chain Monte Carlo), and graph theory are developed, especially as they relate to statistical inference (e.g., bootstrapping, permutation, Bayesian inference, EM algorithm, multivariate analysis)."
        },
        "475": {
            "title": "INTRODUCTION TO COMBINATORICS",
            "description": "Problems of enumeration, distribution, and arrangement. Inclusion-exclusion principle. Generating functions and linear recurrence relations. Combinatorial identities. Graph coloring problems. Finite designs. Systems of distinct representatives and matching problems in graphs. Potential applications in the social, biological, and physical sciences. Puzzles. Problem solving."
        },
        "479": {
            "title": "SPECIAL TOPICS IN STATISTICS",
            "description": "Special topics of interest in undergraduate students."
        },
        "525": {
            "title": "LINEAR OPTIMIZATION",
            "description": "Introduces optimization problems whose constraints are expressed by linear inequalities. Develops geometric and algebraic insights into the structure of the problem, with an emphasis on formal proofs. Presents the theory behind the simplex method, the main algorithm used to solve linear optimization problems. Explores duality theory and theorems of the alternatives."
        },
        "541": {
            "title": "INTRODUCTION TO BIOSTATISTICS",
            "description": "Course designed for the biomedical researcher. Topics include: descriptive statistics, hypothesis testing, estimation, confidence intervals, t-tests, chi-squared tests, analysis of variance, linear regression, correlation, nonparametric tests, survival analysis and odds ratio. Biomedical applications used for each topic."
        },
        "542": {
            "title": "INTRODUCTION TO CLINICAL TRIALS I",
            "description": "Intended for biomedical researchers interested in the design and analysis of clinical trials. Topics include definition of hypotheses, measures of effectiveness, sample size, randomization, data collection and monitoring, and issues in statistical analysis."
        },
        "571": {
            "title": "STATISTICAL METHODS FOR BIOSCIENCE I",
            "description": "Descriptive statistics, distributions, one- and two-sample normal inference, power, one-way ANOVA, simple linear regression, categorical data, non-parametric methods; underlying assumptions and diagnostic work."
        },
        "572": {
            "title": "STATISTICAL METHODS FOR BIOSCIENCE II",
            "description": "Polynomial regression, multiple regression, two-way ANOVA with and without interaction, split-plot design, subsampling, analysis of covariance, elementary sampling, introduction to bioassay."
        },
        "575": {
            "title": "STATISTICAL METHODS FOR SPATIAL DATA",
            "description": "Detecting, quantifying, and modeling spatial patterns and structure in data. Variograms and covariance functions, linear predictions with uncertainty qualification, and conditional simulations. Spectral domain models and spectral densities. Spatial point processes. Contemporary applications and Gaussian process model fitting at scale."
        },
        "601": {
            "title": "STATISTICAL METHODS I",
            "description": "Provides a thorough grounding in modern statistical methods. The specific learning outcomes for the course are to understand data collection in context (how/why data were collected, key questions under study); explore data by effective graphical and numerical summaries; understand probability concepts and models as tools for studying random phenomena and for statistical inference; analyze data using appropriate, modern statistical models, methods, and software; understand the statistical concepts underlying methods; develop the ability to interpret results and critically evaluate the methods used; communicate data analysis and key findings in context."
        },
        "602": {
            "title": "STATISTICAL METHODS II",
            "description": "Provides a thorough grounding in modern statistical methods. The specific learning outcomes for the course are to understand data collection in context (how/why data were collected, key questions under study); explore data by effective graphical and numerical summaries; understand probability concepts and models as tools for studying random phenomena and for statistical inference; analyze data using appropriate, modern statistical models, methods, and software; understand the statistical concepts underlying methods; develop the ability to interpret results and critically evaluate the methods used; communicate data analysis and key findings in context."
        },
        "605": {
            "title": "DATA SCIENCE COMPUTING PROJECT",
            "description": "The development of tools necessary for collecting, managing, and analyzing large data sets. Examples of techniques and programs utilized include Linux, R, distributed computing, powerful editor(s), git/github, and other related tools. Work in the class will be done in teams to research, develop, write, and make presentations related to a variety of data analysis projects."
        },
        "606": {
            "title": "COMPUTING IN DATA SCIENCE AND STATISTICS",
            "description": "A survey of some of the tools and frameworks that are currently popular among data scientists and statisticians working in both academia and industry. Begins with an accelerated introduction to the Python programming language and brief introductions to object-oriented and functional programming. Covers some of the scientific computing platforms available in Python, including tools for numerical and scientific computing; training basic machine learning models; and data visualization. Discusses collecting data from the web both by scraping and using APIs. Concludes with a brief survey of distributed computing platforms, focusing on the MapReduce framework."
        },
        "609": {
            "title": "MATHEMATICAL STATISTICS I",
            "description": "Review of probability, random variables and vectors and their distributions, moments and inequalities, generating functions, transformations of random variables, sampling and distribution theory, convergence concepts for sequences of random variables, laws of large numbers, central limit and other limit theorems."
        },
        "610": {
            "title": "INTRODUCTION TO STATISTICAL INFERENCE",
            "description": "Conditioning, distribution theory, approximation to distributions, modes of convergence, limit theorems, statistical models, parameter estimation, comparision of estimators, confidence sets, theory of hypothesis tests, introduction to Bayesian inference and nonparametric estimation."
        },
        "611": {
            "title": "STATISTICAL MODELS FOR DATA SCIENCE",
            "description": "Probability, random variables and their distributions, joint and conditional distributions, moments and inequalities, generating functions, transformations of random variables, sampling and distribution theory, convergence concepts and limit theorems for sequences of random variables."
        },
        "612": {
            "title": "STATISTICAL INFERENCE FOR DATA SCIENCE",
            "description": "Statistical models, methods and theory for parameter estimation, Bayesian approach to parameter estimation, methods and theory for hypothesis tests, confidence sets, two-sample testing and ANOVA, categorical data analysis, linear regression."
        },
        "613": {
            "title": "STATISTICAL METHODS FOR DATA SCIENCE",
            "description": "Provides a thorough grounding in modern statistical methods. Introduces statistical techniques and methods of data analysis, including data description, linear regression models, diagnostic tools, prediction and model selection, and experimental design."
        },
        "615": {
            "title": "STATISTICAL LEARNING",
            "description": "The development of a variety of mathematical theories and statistical concepts (1) to understand the properties of those models and methods used for the purpose of prediction from data or decision making from data, and (2) to criticize such models, methods and their consequences. Specifically, the theories and tools that will be developed will include complexity theory, Hilbert spaces, Gaussian processes, Variational Analysis, and concentration inequalities."
        },
        "620": {
            "title": "STATISTICS IN HUMAN GENETICS",
            "description": "Provides a comprehensive survey of statistical methods in human genetics research. Covered topics include linkage analysis, genome-wide association study, rare variant association analysis, meta-analysis, genome and variant annotation, heritability estimation, multi-trait modeling techniques, multi-omic data integration, and genetic risk prediction."
        },
        "627": {
            "title": "PROFESSIONAL SKILLS IN DATA SCIENCE",
            "description": "Covers important aspects of professional development in statistics, including skills with internet tools, sophisticated use of statistical languages (such as R) and other emerging topics."
        },
        "628": {
            "title": "DATA SCIENCE PRACTICUM",
            "description": "Provides an understanding of and experience with turning statistics concepts into practice through data science practicums inspired by realistic projects. Combine theory and methods expertise with communications skills to translate from a vaguely stated project description and complex data set into a concisely summarized analysis, including both written and graphical interpretation that can be used by decision makers in an organization."
        },
        "632": {
            "title": "INTRODUCTION TO STOCHASTIC PROCESSES",
            "description": "Topics include discrete-time Markov chains, Poisson point processes, continuous-time Markov chains, and renewal processes. Applications to queueing, branching, and other models in science, engineering and business."
        },
        "641": {
            "title": "STATISTICAL METHODS FOR CLINICAL TRIALS",
            "description": "Statistical issues in the design of clinical trials, basic survival analysis, data collection and sequential monitoring."
        },
        "642": {
            "title": "STATISTICAL METHODS FOR EPIDEMIOLOGY",
            "description": "Methods for analysis of case-control, cross sectional, and cohort studies. Covers epidemiologic study design, measures of association, rates, classical contingency table methods, and logistic and Poisson regression."
        },
        "643": {
            "title": "CLINICAL TRIAL DESIGN, IMPLEMENTATION, AND ANALYSIS",
            "description": "Gain an understanding of fundamental elements of clinical trials (such as objectives, endpoints, surrogate endpoints, and statistical decisions) and statistical design considerations (such as randomization and blinding). Designs of clinical trials for Phase I, II, and III studies including single-arm, two-arm, and drug combination trials. Introduction to adaptive designs for precision medicine and master protocol designs such as umbrella trials and basket trials."
        },
        "678": {
            "title": "INTRODUCTION TO STATISTICAL CONSULTING",
            "description": "Develop statistical consulting skills to be able to communicate design and analysis to non-technical research collaborators. Provides a supportive environment to experiment with statistical consulting in practice, which will sometimes be uncomfortable and strange. Consulting problems typically do not have a \"right\" answer, and mistakes are encouraged. Take risks in sharing developing ideas in class. Connections with external organizations, such as the private sector and government agencies, will be made through possible internship experiences."
        },
        "679": {
            "title": "SPECIAL TOPICS IN STATISTICS",
            "description": "Special topics in statistics at the master's level. Subject matter varies."
        },
        "681": {
            "title": "SENIOR HONORS THESIS",
            "description": "Mentored individual study for students writing honors thesis, as arranged with a faculty member."
        },
        "682": {
            "title": "SENIOR HONORS THESIS",
            "description": "Mentored individual study for students writing honors thesis, as arranged with a faculty member."
        },
        "698": {
            "title": "DIRECTED STUDY",
            "description": "Directed study projects as arranged with a faculty member."
        },
        "699": {
            "title": "DIRECTED STUDY",
            "description": "Directed study projects as arranged with a faculty member."
        },
        "701": {
            "title": "APPLIED TIME SERIES ANALYSIS, FORECASTING AND CONTROL I",
            "description": "Theory and application of discrete time series models illustrated with forecasting problems. Principles of iterative model building. Representation of dynamic relations by difference equations. Autoregressive integrated Moving Average models. Identification, fitting, diagnostic checking of models. Seasonal model application to forecasting in business, economics, ecology, and engineering used at each stage, which the student analyzes using computer programs which have been specially written and extensively tested."
        },
        "709": {
            "title": "MATHEMATICAL STATISTICS",
            "description": "Introduction to measure theoretic probability; derivation and transformation of probability distributions; generating functions and characteristic functions; conditional expectation, sufficiency, and unbiased estimation; methods of large sample theory including laws of large numbers and central limit theorems; order statistics."
        },
        "710": {
            "title": "MATHEMATICAL STATISTICS",
            "description": "Estimation, efficiency, Neyman-Pearson theory of hypothesis testing, confidence regions, decision theory, analysis of variance, and distribution of quadratic forms."
        },
        "726": {
            "title": "NONLINEAR OPTIMIZATION I",
            "description": "Theory and algorithms for nonlinear optimization, focusing on unconstrained optimization. Line-search and trust-region methods; quasi-Newton methods; conjugate-gradient and limited-memory methods for large-scale problems; derivative-free optimization; algorithms for least-squares problems and nonlinear equations; gradient projection algorithms for bound-constrained problems; and simple penalty methods for nonlinearly constrained optimization. Students are strongly encouraged to have knowledge of linear algebra and familiarity with basic mathematical analysis."
        },
        "727": {
            "title": "THEORY AND METHODS OF LONGITUDINAL DATA ANALYSIS",
            "description": "Theory and methods of fundamental statistical models for the analysis of longitudinal data, including repeated measures analysis of variance, linear mixed models, generalized linear mixed models, and generalized estimating equations. Introduction of how to implement these methods in statistical softwares such as in R and/or SAS, within the context of appropriate statistical models and carry out and interpret analyses."
        },
        "732": {
            "title": "LARGE SAMPLE THEORY OF STATISTICAL INFERENCE",
            "description": "Stochastic modes of convergence. Asymptotic theory of normed sums of random variables with applications to asymptotic normality of estimators. Methods for deriving limit distributions of nonlinear statistics. Asymptotic relative efficiencies. Asymptotic confidence regions and tests of hypotheses. Models of non-identically distributed or dependent random variables."
        },
        "733": {
            "title": "THEORY OF PROBABILITY I",
            "description": "An introduction to measure theoretic probability and stochastic processes.Topics include foundations, independence, zero-one laws, laws of large numbers, convergence in distribution, characteristic functions, central limit theorems, random walks, conditional expectations. Familiarity with basic measure theory (e.g.MATH 629or721) or concurrent registration inMATH 721is strongly recommended."
        },
        "734": {
            "title": "THEORY OF PROBABILITY II",
            "description": "Possible topics include martingales, weak convergence of measures, introduction to Brownian motion."
        },
        "741": {
            "title": "SURVIVAL ANALYSIS THEORY AND METHODS",
            "description": "Theory and practice of analytic methods for censored survival data, including nonparametric and parametric methods, the proportional hazards regression model, and a review of current topics in survival analysis."
        },
        "760": {
            "title": "MULTIVARIATE ANALYSIS I",
            "description": "Multivariate normal distribution, estimation of mean and covariance matrix; Wishart distribution; distribution of partial and multiple correlation coefficients; Hotelling's T-squared, principal components."
        },
        "761": {
            "title": "DECISION TREES FOR MULTIVARIATE ANALYSIS",
            "description": "Tree construction, including finding splits, tree-pruning and error estimation. Categorical predictor variables, missing or censored data, prior class-probabilities, and unequal misclassification costs. Selection bias. Comparison with other statistics and machine-learning methods. Extensions to piecewise linear and non-least squares regression models."
        },
        "768": {
            "title": "STATISTICAL METHODS FOR MEDICAL IMAGE ANALYSIS",
            "description": "Introduce key statistical methods and concepts for analyzing various medical images. Analyze publicly available and student/instructor supplied imaging data using the most up-to-date methods and tools."
        },
        "771": {
            "title": "STATISTICAL COMPUTING",
            "description": "The design of statistical software including special techniques for probability distributions, methods of simulation of random processes, numerical methods for linear models and multivariate analysis, and methods for nonlinear models."
        },
        "772": {
            "title": "LINEAR RANDOMIZED ALGORITHMS FOR DATA SCIENCE",
            "description": "Introduce new algorithms that leverage randomization to address the scale, speed, and sensitivity needs of modern data science. Develop the mathematical foundations of such randomized algorithms. Criticize these algorithms through the lens of computational resource utilization. Implement these algorithms to address linear problems in data science."
        },
        "775": {
            "title": "INTRODUCTION TO BAYESIAN DECISION AND CONTROL I",
            "description": "Common sampling models in business and economic problems, information from data, likelihood function of parameters, choices of models, Bayes' Theorem, subjective basis for probability, sequential nature of Bayesian inference, prior and posterior distributions of parameters in binomial, poisson, exponential and normal populations, comparison of two normal distributions, predictive distributions, decision theory, utility, risk aversion, extensive form of analysis, two-action problems, point estimation, best population problems, economics of sampling."
        },
        "780": {
            "title": "INTRODUCTION TO QUANTUM DATA SCIENCE",
            "description": "Quantum computation issues, including probability, statistics, sensing, information, machine learning, and applying data science to quantum information science."
        },
        "801": {
            "title": "ADVANCED FINANCIAL STATISTICS",
            "description": "Statistical theory and methodology for modern financial data. Topics include financial stochastic models based on time series and stochastic calculus, modern statistical inference, and statistical learning for financial data as well as their applications to financial problems."
        },
        "803": {
            "title": "EXPERIMENTAL DESIGN I",
            "description": "Summary of matrix algebra required, theory of estimable functions, incomplete blocks, balanced incomplete block designs, partially balanced incomplete block designs."
        },
        "809": {
            "title": "NON PARAMETRIC STATISTICS",
            "description": "Statistical procedures valid under unrestrictive assumptions; sign test; confidence intervals; efficiency comparisons; signed rank procedures; Walsh sums; point estimators; two sample rank tests; zeros, ties, and other problems of discrete data; order statistics; Winsorized and truncated point estimators and connection with gross error models; permutation procedures; combinatorial problems, and computer applications."
        },
        "811": {
            "title": "SAMPLE SURVEY THEORY AND METHOD",
            "description": "Simple random sampling; systematic sampling; probability sampling; stratified sampling; subsampling with units of equal and unequal size; double sampling; multi-stage and multi-phase sampling; ratio and regression estimates; model-based and model-assisted approaches; variance estimation; non-response."
        },
        "828": {
            "title": "SEMIPARAMETRIC METHODS IN DATA SCIENCE",
            "description": "Review of statistical convergence modes, M-estimation, and basics of Hilbert space. Introduction of how to derive the nuisance tangent space, its complement, and the corresponding efficient influence function, from the geometric perspective of semiparametric models. Introduction of how to estimate nuisance functions using machine learning methods, and their implementations in R and/or Python. Introduction of a variety of semiparametric models in missing data analysis, causal inference, dimension reduction, precision medicine, semi-supervised learning, transfer learning and domain adaptation."
        },
        "833": {
            "title": "TOPICS IN THE THEORY OF PROBABILITY",
            "description": "Advanced topics in probability and stochastic processes."
        },
        "834": {
            "title": "EMPIRICAL PROCESSES AND SEMIPARAMETRIC INFERENCE",
            "description": "Empirical process methods in statistics; semiparametric models; stochastic convergence in metric spaces; Glivenko-Cantelli and Donsker theorems; entropy calculations; bootstrapped empirical processes; functional delta method; Z-estimators; M-estimators; rates of convergence; semiparametric efficiency; semiparametric estimating equations; nonparametric maximum likelihood."
        },
        "840": {
            "title": "STATISTICAL MODEL BUILDING AND LEARNING",
            "description": "Theory of reproducing kernel Hilbert spaces in statistical model building; bounded linear functionals and representer theory; smoothing splines; ANOVA spines; degees of freedom for signal and the bias-variance tradeoff; Bayesian confidence intervals; model selection."
        },
        "841": {
            "title": "NONPARAMETRIC STATISTICS AND MACHINE LEARNING METHODS",
            "description": "Statistical function estimation and classification; reproducing kernel machines, support vector machines; high dimensional model selection and estimation; Bayesian, empirical Bayesian interpretation of nonparametric learning methods; log density ANOVA and graphical models; tree ensemble methods including bagging, boosting, and random forest."
        },
        "849": {
            "title": "THEORY AND APPLICATION OF REGRESSION AND ANALYSIS OF VARIANCE I",
            "description": "Theory and applications of the general linear model; graphical methods; simultaneous inference; regression diagnostics; analysis of variance of fixed, random and mixed effects models; ANCOVA: violations of assumptions."
        },
        "850": {
            "title": "THEORY AND APPLICATION OF REGRESSION AND ANALYSIS OF VARIANCE II",
            "description": "Theory and applications of the general linear model; graphical methods; simultaneous inference; regression diagnostics; analysis of variance of fixed, random and mixed effects models; ANCOVA: violations of assumptions."
        },
        "860": {
            "title": "ESTIMATION OF FUNCTIONS FROM DATA",
            "description": "Statistical and appoximation theoretic methods of estimating functions and values of functionals from experimental data; experimental design and data analysis problems that arise as problems in approximation theory; convergence theorems; ill-posed inverse problems; Banach and Hilbert space penalty functionals."
        },
        "861": {
            "title": "THEORETICAL FOUNDATIONS OF MACHINE LEARNING",
            "description": "Advanced mathematical theory and methods of machine learning. Statistical learning theory, Vapnik-Chevronenkis Theory, model selection, high-dimensional models, nonparametric methods, probabilistic analysis, optimization, learning paradigms."
        },
        "877": {
            "title": "STATISTICAL METHODS FOR MOLECULAR BIOLOGY",
            "description": "Statistical and computational methods in statistical genomics for human and experimental populations. Review methods for quality control, experimental design, clustering, network analysis, and other downstream analysis of next-generation sequencing studies along with methods for genome wide association studies."
        },
        "888": {
            "title": "TOPICS IN MATHEMATICAL DATA SCIENCE",
            "description": "Advanced topics in the mathematical foundations of data science"
        },
        "990": {
            "title": "RESEARCH",
            "description": "Independent research and writing for graduate students under the supervision of a faculty member."
        },
        "992": {
            "title": "SEMINAR",
            "description": "Special topics in statistics at the graduate level. Subject matter varies."
        },
        "998": {
            "title": "STATISTICAL CONSULTING",
            "description": "Consulting apprenticeship."
        }
    }
}